#Область ОписаниеОбработки

Функция СведенияОВнешнейОбработке() Экспорт

	//ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.1.3.1");
	//ПараметрыРегистрации.БезопасныйРежим = Истина;
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.1");
	
	Разрешение = РаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса("http", "hlsapp3.ascgroup.local");
	ПараметрыРегистрации.Разрешения.Добавить(Разрешение);
	
	Разрешение = РаботаВБезопасномРежиме.РазрешениеНаИспользованиеИнтернетРесурса("http", "hlsapp4.ascgroup.local");
	ПараметрыРегистрации.Разрешения.Добавить(Разрешение);
	
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия = Метаданные().Комментарий;
	ПараметрыРегистрации.Информация = "Загрузка платежей из РИС";
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = Метаданные().Представление() + " - Открыть форму";
	НоваяКоманда.Идентификатор = Метаданные().Имя + "Форма";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	НоваяКоманда.ПоказыватьОповещение = Ложь;
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = "Загрузить платежи из РИС";
	НоваяКоманда.Идентификатор = "ЗагрузитьПлатежи";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	НоваяКоманда.ПоказыватьОповещение = Ложь;

	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = "Конвертировать платежи РИС";
	НоваяКоманда.Идентификатор = "КонвертироватьПлатежи";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	НоваяКоманда.ПоказыватьОповещение = Ложь;

	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = "Загрузить и конвертировать платежи РИС";
	НоваяКоманда.Идентификатор = "ЗагрузитьИКонвертироватьПлатежи";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	НоваяКоманда.ПоказыватьОповещение = Ложь;

	Возврат ПараметрыРегистрации;

КонецФункции

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыКоманды = Неопределено) Экспорт 
	
	Параметры = Новый Структура;
	
	Параметры.Вставить("База",        Справочники.ВнешниеИнформационныеБазы.НайтиПоНаименованию("РИС"));
	Параметры.Вставить("ПерезаполнятьДокументы",   Ложь);
	Параметры.Вставить("ПерезаполнятьДоговоры",    Ложь);
	Параметры.Вставить("ВыводитьСообщения",        Ложь);
	Параметры.Вставить("ОтложенноеПроведение",     Истина);
	
	Если ИдентификаторКоманды = "ЗагрузитьПлатежи" Тогда
		
		Параметры.Вставить("ДатаКон", КонецДня(ТекущаяДата()));
		Параметры.Вставить("ДатаНач", НачалоДня(ТекущаяДата() - 86400));
		ЗагрузитьПлатежи(Параметры);
		
	ИначеЕсли ИдентификаторКоманды = "КонвертироватьПлатежи" Тогда
		
		Параметры.Вставить("ДатаКон", '2100-01-01');
		Параметры.Вставить("ДатаНач", '0001-01-01');
		КонвертироватьПлатежи(Параметры);
		
	ИначеЕсли ИдентификаторКоманды = "ЗагрузитьИКонвертироватьПлатежи" Тогда
		
		Параметры.Вставить("ДатаКон", КонецДня(ТекущаяДата()));
		Параметры.Вставить("ДатаНач", НачалоДня(ТекущаяДата() - 86400));
		ЗагрузитьПлатежи(Параметры);
		
		Параметры.Вставить("ДатаКон", '2100-01-01');
		Параметры.Вставить("ДатаНач", '0001-01-01');
		КонвертироватьПлатежи(Параметры);
		
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти

Процедура ЗагрузитьПлатежи(Параметры, АдресРезультата = Неопределено) Экспорт
	
	АСЦ_ЗагрузкаРИС.ЗагрузитьПлатежи(Параметры, АдресРезультата);
	
КонецПроцедуры

Процедура КонвертироватьПлатежи(Параметры, АдресРезультата = Неопределено) Экспорт
	
	АСЦ_ЗагрузкаРИС.КонвертироватьПлатежи(Параметры, АдресРезультата);
	
КонецПроцедуры