
&НаКлиенте
Процедура Загрузить(Команда)
	
	ЗагрузитьСервер();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСервер()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.Загрузить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокОтчетов(Команда)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ПериодОтчета", Объект.Период);
	СтруктураОтбора.Вставить("ВидОтчета",    ПолучитьВидОтчета());
	
	ПараметрыФормы = Новый Структура;
	Параметрыформы.Вставить("Отбор", СтруктураОтбора);
	
	ОткрытьФорму("Документ.НастраиваемыйОтчет.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидОтчета()
	
	Возврат Справочники.ВидыОтчетов.НайтиПоКоду("UNICUS");
	
КонецФункции	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		Элементы.Отладка.Видимость = Ложь;
	Иначе
		Объект.Отладка = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиДляРегЗадания(Команда)
	СохранитьНастройкиДляРегЗаданияНаСервере();
	Состояние("Настройки сохранены");
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиДляРегЗаданияНаСервере()
	
	ХранилищеОбщихНастроек.Сохранить("ЗагрузитьОтчетUNICUS", "ВИБ", Объект.ВИБ);
	
КонецПроцедуры
