
&Вместо("ОбработкаЗаполненияКонтрагентыОбработкаЗаполнения")
Процедура АСЦ1_ОбработкаЗаполненияКонтрагентыОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Перем ЭтоНоваяОрганизацияУХ;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ЭтоНоваяОрганизацияУХ", ЭтоНоваяОрганизацияУХ) Тогда
		
		Источник.ДополнительныеСвойства.Вставить("ЭтоНоваяОрганизацияУХ", ЭтоНоваяОрганизацияУХ);

		Если ДанныеЗаполнения.Свойство("Организация") Тогда
			ЗаполнитьКонтрагентаПоОрганизации(Источник, ДанныеЗаполнения.Организация);
		КонецЕсли;
		
	КонецЕсли;
	
	//АСЦ Ситников++
	// Для группы не доступен реквизит "ГруппаКонтрагента"
	Если Источник.ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;	
	//АСЦ Ситников--
	
	Если Не ЗначениеЗаполнено(Источник.ГруппаКонтрагента) Тогда
		Источник.ГруппаКонтрагента = Справочники.ГруппыКонтрагентов.ПолучитьТретьиСтороны();
	КонецЕсли;
	
КонецПроцедуры
