
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	База = Справочники.ВнешниеИнформационныеБазы.НайтиПоНаименованию("Юникус");
	Договор = Параметры.Договор;
	Если ЗначениеЗаполнено(Договор) Тогда
		ОбновитьНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	
	ТекстЗапроса =
	"SELECT
	|	*
	|FROM
	|	unicusweb.V_ASC_PAY_CONTRACT
	|WHERE
	|	CASE WHEN POLICY_NUMBER LIKE POLICY_SERIA || '%'
	|		THEN REPLACE(POLICY_NUMBER, ' ', '')
	|		ELSE REPLACE(POLICY_SERIA, ' ', '') || REPLACE(POLICY_NUMBER, ' ', '')
	|	END = '" + СокрЛП(Договор) + "'
	|ORDER BY
	|	PAY_DATE Desc";
	
	СтрокаСоединения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(База, "СтрокаПодключения");
	
	Соединение = Новый COMОбъект("ADODB.Connection");
	Соединение.Open(СтрокаСоединения);
	
	Таблица = АСЦ_ОбщийМодуль.ВыполнитьЗапросADO(Соединение, ТекстЗапроса);
	ТалицаОплаты.Загрузить(Таблица);
	
	ТекстЗапроса =
	"SELECT
	|	*
	|FROM
	|	unicusweb.V_ASC_ACT
	|WHERE
	|	ACT_ID IN 
	|		(SELECT 
	|			ACT_ID
	|		 FROM
	|			unicusweb.V_ASC_ACT
	|		 WHERE
	|			COL4 || COL5 = '" + Договор + "')
	|	AND (COL1 IS NOT NULL 
	|		 OR COL4 || COL5 = '" + Договор + "')";
	
	СтрокаСоединения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(База, "СтрокаПодключения");
	
	Соединение = Новый COMОбъект("ADODB.Connection");
	Соединение.Open(СтрокаСоединения);
	
	Таблица = АСЦ_ОбщийМодуль.ВыполнитьЗапросADO(Соединение, ТекстЗапроса);
	ТаблицаАкты.Загрузить(Таблица);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	Если ЗначениеЗаполнено(Договор) Тогда
		Настройки.Удалить("Договор");
	КонецЕсли;
	
КонецПроцедуры
