
&Вместо("СгруппироватьСтрокиРаскрытия")
Процедура АСЦ1_асцСгруппироватьСтрокиРаскрытия(СтрРаскрытия)
	
	Если СтрРаскрытия.ТаблицаРаскрытия.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	Обл = ТабДок.Области.Найти("Строка_"+СтрРаскрытия.КодСтроки);
	Если Обл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Верх=Обл.Верх;
	
	ОбластьОбработки=ТабДок.Область("R"+Формат((Верх+1),"ЧГ=0")+":R"+Формат((Верх+СтрРаскрытия.ТабДокРаскрытие.ВысотаТаблицы),"ЧГ=0"));
	
	НоваяСтрока=ТабРаскрытиеГруппСтроки.Добавить();
	НоваяСтрока.Строка=СтрРаскрытия.Строка;
	НоваяСтрока.НачалоГруппы=Верх+1;
	НоваяСтрока.КонецГруппы=Верх+СтрРаскрытия.ТабДокРаскрытие.ВысотаТаблицы;
	НоваяСтрока.ДобавленаВручную=Ложь;
	НоваяСтрока.УровеньГруппировки=2;
	
	ОбластьОбработки.Сгруппировать();
	// АСЦ Ситников++
	// Автоматически разворачиваем все аналитики
	//ОбластьОбработки.Видимость=Ложь;
	// АСЦ Ситников--
	
КонецПроцедуры
