
Функция ПолучитьСтруктуруПроцентаКВ(Контрагент, ДЦ, Дата) Экспорт
	
	Результат = Новый Структура("Организация, ПроцентКВ",, 0);
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Контрагент", Контрагент);
	Запрос.Параметры.Вставить("ДЦ",         ДЦ);
	Запрос.Параметры.Вставить("Месяц",      НачалоМесяца(Дата));
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Порядок,
	|	Рег.Организация КАК Организация,
	|	Рег.ПроцентКВ КАК ПроцентКВ
	|ИЗ
	|	РегистрСведений.АСЦ_ПлановыеПроцентыКВ КАК Рег
	|ГДЕ
	|	Рег.Контрагент = &Контрагент
	|	И Рег.ДЦ = &ДЦ
	|	И Рег.Период = &Месяц
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	Рег.Организация,
	|	Рег.ПроцентКВ
	|ИЗ
	|	РегистрСведений.АСЦ_ПлановыеПроцентыКВ КАК Рег
	|ГДЕ
	|	Рег.Контрагент = &Контрагент
	|	И Рег.ДЦ = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И Рег.Период = &Месяц
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ЗаполнитьЗначенияСвойств(Результат, РезультатЗапроса.Выгрузить()[0]);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	