
Функция ПолучитьСтруктуруПроцентаКВ(Контрагент, ПродавецАвто, ТипАвто, Дата) Экспорт
	
	Результат = Новый Структура("Организация, ПроцентКВ",, 0);
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("КонтрагентИНН", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "ИНН"));
	Запрос.Параметры.Вставить("ПродавецАвто",  ПродавецАвто);
	Запрос.Параметры.Вставить("ТипАвто",       ТипАвто);
	Запрос.Параметры.Вставить("Месяц",         НачалоМесяца(Дата));
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Порядок,
	|	Рег.Организация КАК Организация,
	|	Рег.ПроцентКВ КАК ПроцентКВ
	|ИЗ
	|	РегистрСведений.АСЦ_ПлановыеПроцентыКВ КАК Рег
	|ГДЕ
	|	Рег.Контрагент.ИНН = &КонтрагентИНН
	|	И Рег.ПродавецАвто = &ПродавецАвто
	|	И Рег.ТипАвто = &ТипАвто
	|	И Рег.Период = &Месяц
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	2 КАК Порядок,
	|	Рег.Организация КАК Организация,
	|	Рег.ПроцентКВ КАК ПроцентКВ
	|ИЗ
	|	РегистрСведений.АСЦ_ПлановыеПроцентыКВ КАК Рег
	|ГДЕ
	|	Рег.Контрагент.ИНН = &КонтрагентИНН
	|	И Рег.ПродавецАвто = &ПродавецАвто
	|	И Рег.ТипАвто = 0
	|	И Рег.Период = &Месяц
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	Рег.Организация,
	|	Рег.ПроцентКВ
	|ИЗ
	|	РегистрСведений.АСЦ_ПлановыеПроцентыКВ КАК Рег
	|ГДЕ
	|	Рег.Контрагент.ИНН = &КонтрагентИНН
	|	И Рег.ПродавецАвто = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	И Рег.Период = &Месяц
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ЗаполнитьЗначенияСвойств(Результат, РезультатЗапроса.Выгрузить()[0]);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	