
Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	
	СпрОбъект = Справочники.АСЦ_ВидыОперацийПлановоеНачислениеКВ.КВБанков.ПолучитьОбъект();
	СпрОбъект.ДвиженияСумма = "СуммаКВ";
	СпрОбъект.НастройкаСоотвествияВыгрузкаАстра = Справочники.СоответствиеВнешнимИБ.НайтиПоНаименованию("КВ банков");
	СпрОбъект.ФиксированнаяСебестоимость = Ложь;
	СпрОбъект.УчетПоДоговорам            = Ложь;
	СпрОбъект.ПривязыватьКРеализации     = Истина;
	СпрОбъект.УчетПоНоменклатуре         = Ложь;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.АСЦ_ВидыОперацийПлановоеНачислениеКВ.ОплатаВБанке.ПолучитьОбъект();
	СпрОбъект.ДвиженияСумма = "СуммаКВ";
	СпрОбъект.НастройкаСоотвествияВыгрузкаАстра = Справочники.СоответствиеВнешнимИБ.НайтиПоНаименованию("Реализация ОФУ");
	СпрОбъект.ФиксированнаяСебестоимость = Ложь;
	СпрОбъект.УчетПоДоговорам            = Истина;
	СпрОбъект.ПривязыватьКРеализации     = Ложь;
	СпрОбъект.УчетПоНоменклатуре         = Истина;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.АСЦ_ВидыОперацийПлановоеНачислениеКВ.ДопКВСтраховки.ПолучитьОбъект();
	СпрОбъект.ДвиженияСумма = "СуммаКВ";
	СпрОбъект.НастройкаСоотвествияВыгрузкаАстра = Справочники.СоответствиеВнешнимИБ.НайтиПоНаименованию("");
	СпрОбъект.ФиксированнаяСебестоимость = Ложь;
	СпрОбъект.УчетПоДоговорам            = Ложь;
	СпрОбъект.ПривязыватьКРеализации     = Ложь;
	СпрОбъект.УчетПоНоменклатуре         = Ложь;
	СпрОбъект.СводныйУчет                = Истина;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.АСЦ_ВидыОперацийПлановоеНачислениеКВ.ДиагностическаяКарта.ПолучитьОбъект();
	СпрОбъект.ДвиженияСумма = "СуммаКВ";
	СпрОбъект.НастройкаСоотвествияВыгрузкаАстра = Справочники.СоответствиеВнешнимИБ.НайтиПоНаименованию("Реализация ОФУ");
	СпрОбъект.ФиксированнаяСебестоимость = Истина;
	СпрОбъект.УчетПоДоговорам            = Ложь;
	СпрОбъект.ПривязыватьКРеализации     = Ложь;
	СпрОбъект.УчетПоНоменклатуре         = Ложь;
	СпрОбъект.СводныйУчет                = Истина;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.АСЦ_ВидыОперацийПлановоеНачислениеКВ.ПрямыеРасчетыССК.ПолучитьОбъект();
	СпрОбъект.ДвиженияСумма = "СуммаКВ";
	СпрОбъект.НастройкаСоотвествияВыгрузкаАстра = Справочники.СоответствиеВнешнимИБ.НайтиПоНаименованию("Реализация ОФУ");
	СпрОбъект.ФиксированнаяСебестоимость = Ложь;
	СпрОбъект.УчетПоДоговорам            = Истина;
	СпрОбъект.ПривязыватьКРеализации     = Ложь;
	СпрОбъект.УчетПоНоменклатуре         = Истина;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.АСЦ_ВидыОперацийПлановоеНачислениеКВ.Страховки.ПолучитьОбъект();
	СпрОбъект.ДвиженияСумма = "СуммаКВ";
	СпрОбъект.НастройкаСоотвествияВыгрузкаАстра = Справочники.СоответствиеВнешнимИБ.НайтиПоНаименованию("Реализация ОФУ");
	СпрОбъект.ФиксированнаяСебестоимость = Ложь;
	СпрОбъект.УчетПоДоговорам            = Истина;
	СпрОбъект.ПривязыватьКРеализации     = Ложь;
	СпрОбъект.УчетПоНоменклатуре         = Истина;
	СпрОбъект.ОтражатьВБУ                = Истина;
	СпрОбъект.Записать();
	
КонецПроцедуры
