
Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	
	СпрОбъект = КВБанков.ПолучитьОбъект();
	СпрОбъект.ДвиженияСумма = "СуммаКВ";
	СпрОбъект.НастройкаСоотвествияВыгрузкаАстра = Справочники.СоответствиеВнешнимИБ.НайтиПоНаименованию("КВ банков");
	СпрОбъект.ФиксированнаяСебестоимость = Ложь;
	СпрОбъект.ФормироватьКорректировки   = Истина;
	СпрОбъект.ОтражатьВБУ                = Ложь;
	СпрОбъект.Записать();
	
	СпрОбъект = ОплатаВБанке.ПолучитьОбъект();
	СпрОбъект.ДвиженияСумма = "СуммаКВ";
	СпрОбъект.НастройкаСоотвествияВыгрузкаАстра = Справочники.СоответствиеВнешнимИБ.НайтиПоНаименованию("КВ банков");
	СпрОбъект.ФиксированнаяСебестоимость = Ложь;
	СпрОбъект.ФормироватьКорректировки   = Истина;
	СпрОбъект.ОтражатьВБУ                = Ложь;
	СпрОбъект.Записать();
	
	СпрОбъект = ДопКВСтраховки.ПолучитьОбъект();
	СпрОбъект.ДвиженияСумма = "СуммаКВ";
	СпрОбъект.НастройкаСоотвествияВыгрузкаАстра = Справочники.СоответствиеВнешнимИБ.НайтиПоНаименованию("КВ банков");
	СпрОбъект.ФиксированнаяСебестоимость = Ложь;
	СпрОбъект.ФормироватьКорректировки   = Истина;
	СпрОбъект.ОтражатьВБУ                = Ложь;
	СпрОбъект.Записать();
	
	СпрОбъект = ДиагностическаяКарта.ПолучитьОбъект();
	СпрОбъект.ДвиженияСумма = "СуммаКВ";
	СпрОбъект.НастройкаСоотвествияВыгрузкаАстра = Справочники.СоответствиеВнешнимИБ.НайтиПоНаименованию("Реализация ОФУ");
	СпрОбъект.ФиксированнаяСебестоимость = Истина;
	СпрОбъект.ФормироватьКорректировки   = Истина;
	СпрОбъект.ОтражатьВБУ                = Ложь;
	СпрОбъект.Записать();
	
	СпрОбъект = ПрямыеРасчетыССК.ПолучитьОбъект();
	СпрОбъект.ДвиженияСумма = "СуммаКВ";
	СпрОбъект.НастройкаСоотвествияВыгрузкаАстра = Справочники.СоответствиеВнешнимИБ.НайтиПоНаименованию("Реализация ОФУ");
	СпрОбъект.ФиксированнаяСебестоимость = Ложь;
	СпрОбъект.ФормироватьКорректировки   = Истина;
	СпрОбъект.ОтражатьВБУ                = Ложь;
	СпрОбъект.Записать();
	
	СпрОбъект = Страховки.ПолучитьОбъект();
	СпрОбъект.ДвиженияСумма = "Сумма";
	СпрОбъект.НастройкаСоотвествияВыгрузкаАстра = Справочники.СоответствиеВнешнимИБ.НайтиПоНаименованию("Реализация ОФУ");
	СпрОбъект.ФиксированнаяСебестоимость = Ложь;
	СпрОбъект.ОтражатьВБУ                = Истина;
	СпрОбъект.ФормироватьКорректировки   = Истина;
	СпрОбъект.Записать();
	
КонецПроцедуры

Функция ПолучитьСтатьюПоЦФО(Ссылка, ЦФО) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Запрос.Параметры.Вставить("ЦФО",    ЦФО);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Спр.Статья КАК Статья
	|ИЗ
	|	Справочник.АСЦ_ВидыОперацийПлановоеНачислениеКВ.ДоступныеЦФО КАК Спр
	|ГДЕ
	|	Спр.Ссылка = &Ссылка
	|	И Спр.ЦФО = &ЦФО";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Справочники.СтатьиДоходовИРасходов.ПустаяСсылка();
	Иначе	
	    Возврат Результат.Выгрузить()[0][0];
	КонецЕсли;	
	
КонецФункции	