
&НаКлиенте
Процедура Прочитать(Команда)
	ПрочитатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаСервере()
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Прочитать(ИмяФайла);
	
	Таблица.Очистить();
	Для Счетчик = 2 По ТабДок.ВысотаТаблицы Цикл
		
		Наименование = ТабДок.Область(Счетчик, 1).Текст;
		ГУИД = ТабДок.Область(Счетчик, 2).Текст;
		
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.Организация = Справочники.Организации.НайтиПоНаименованию(Наименование);
		НоваяСтрока.ГУИДФайл = ГУИД;
		Если ЗначениеЗаполнено(НоваяСтрока.Организация) Тогда
			НоваяСтрока.ГУИД = Строка(НоваяСтрока.Организация.УникальныйИдентификатор());
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовый(Команда)
	СоздатьНовыйНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьНовыйНаСервере()
	
	ТекущиеДанные = Таблица.НайтиПоИдентификатору(Элементы.Таблица.ТекущаяСтрока);
	
	СпрОбъект = ТекущиеДанные.Организация.Скопировать();
	СсылкаНового = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(ТекущиеДанные.гуидФайл));
	СпрОбъект.УстановитьСсылкуНового(СсылкаНового);
	
	СпрОбъектСтарый = ТекущиеДанные.Организация.ПолучитьОбъект();
	СпрОбъектСтарый.Наименование = СпрОбъектСтарый.Наименование + " Х";
	СпрОбъектСтарый.ОбменДанными.Загрузка = Истина;
	СпрОбъектСтарый.Записать();
	
	СпрОбъект.Записать();
	
КонецПроцедуры
