
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	База = Справочники.ВнешниеИнформационныеБазы.НайтиПоНаименованию("Юникус");
	ТолькоУправлениескиеОрганизации = Истина;
	
	ДатаНачала = '2016-01-01';
	
КонецПроцедуры

&НаКлиенте
Процедура Прочитать(Команда)
	ПрочитатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаСервере()
	
	СтрокаСоединения = УправлениеСоединениямиВИБУХ.ПолучитьСтрокуСоединенияADO(База);
	
	ТекстЗапроса = 
	"SELECT DISTINCT
	|	tab.SK_NAME as Наименование,
	|	tab.SK_INN as ИНН,
	|	tab.SK_KPP as КПП
	|FROM
	|	v_asc_pay_contract tab
	|WHERE
	|	tab.PAY_DATE >= &ДатаНач
	|ORDER BY
	|	1";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДатаНач", ИнтеграцияСВнешнимиСистемамиУХ.АСЦ1_асцПолучитьТекстПараметра(ДатаНачала, "Oracle"));
	
	Соединение = Новый COMОбъект("ADODB.Connection");
	Соединение.Open(СтрокаСоединения);
	
	мНаборЗаписей = Соединение.Execute(ТекстЗапроса);
	
	ТаблицаДанных.Очистить();
	
	Пока НЕ мНаборЗаписей.EOF Цикл
			
		НоваяСтрока = ТаблицаДанных.Добавить();
		НоваяСтрока.Наименование = мНаборЗаписей.Fields("Наименование").Value;
		НоваяСтрока.ИНН = мНаборЗаписей.Fields("ИНН").Value;
		НоваяСтрока.КПП = мНаборЗаписей.Fields("КПП").Value;
		
		мНаборЗаписей.MoveNext();
		
	КонецЦикла;	
	
	мНаборЗаписей.Close();
	
	Для каждого СтрокаТЗ из ТаблицаДанных Цикл
		
		Если ЗначениеЗаполнено(СтрокаТЗ.ИНН) Тогда
			
			СтрокаТЗ.Контрагент = АСЦ_ОбщийМодуль.НайтиКонтрагента(СтрокаТЗ.Наименование, СтрокаТЗ.ИНН, СтрокаТЗ.КПП);
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЗ.Контрагент) Тогда
				СтрокаТЗ.Контрагент = АСЦ_ОбщийМодуль.НайтиКонтрагента(СтрокаТЗ.Наименование, СтрокаТЗ.ИНН, "");
				СтрокаТЗ.КПП_1С = СтрокаТЗ.Контрагент.КПП;
			КонецЕсли;
			
		КонецЕсли;	

	КонецЦикла;	
	
КонецПроцедуры
