
&НаКлиенте
Процедура Прочитать(Команда)
	ПрочитатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Родитель", Справочники.Номенклатура.НайтиПоНаименованию("Страховки"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Родитель = &Родитель";
	
	ТаблицаДанных.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Кэш = Новый Соответствие;
	Для каждого СтрокаТЗ из ТаблицаДанных Цикл
		СтрокаТЗ.Статья = АСЦ_ПоискОбъектов.ПолучитьОбъектПоСоотвествию(СтрокаТЗ.Наименование, Объект.Настройка, Объект.База, Кэш);
	КонецЦикла;	
	
	Элементы.ТаблицаДанныхЗаписать.КнопкаПоУмолчанию = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;	
	
	ЗаписатьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "НаименованиеUNICUS");
	
	Для каждого СтрокаТЗ из ТаблицаДанных Цикл
		
		Если НЕ СтрокаТЗ.Изменен Тогда
			Продолжить;
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЗ.Статья) Тогда
			Продолжить;
		КонецЕсли;	
		
		Запись = РегистрыСведений.СоответствиеОбъектовТекущейИВнешнихИБ.СоздатьМенеджерЗаписи();
		Запись.ОбъектТекущейИБ = СтрокаТЗ.Статья;
		Запись.ИспользуемаяИБ  = Объект.База;
		Запись.ОбъектВнешнейИБ = СтрокаТЗ.Наименование;
		Запись.НастройкаСоответствия = Объект.Настройка;
		Запись.Записать();
		
		СтрокаТЗ.Изменен = Ложь;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанныхОрганизацияПриИзменении(Элемент)
	
	Элементы.ТаблицаДанных.ТекущиеДанные.Изменен = Истина;
	
КонецПроцедуры

&НаСервере
Процедура БазаПриИзмененииНаСервере()
	
	Объект.ТипБазы = Объект.База.ТипБД;
	
КонецПроцедуры

&НаКлиенте
Процедура БазаПриИзменении(Элемент)
	БазаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНастройку(Команда)
	СоздатьНастройкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьНастройкуНаСервере()
	
	СпрОбъект = Справочники.СоответствиеВнешнимИБ.СоздатьЭлемент();
	СпрОбъект.Владелец = Объект.ТипБазы;
	СпрОбъект.Наименование = "Номенклатура <-> Статьи доходов";
	СпрОбъект.ОбменДанными.Загрузка = Истина;
	СпрОбъект.Записать();
	
	Объект.Настройка = СпрОбъект.Ссылка;
	
КонецПроцедуры
