#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// ПОДГОТОВКА ПАРАМЕТРОВ ПРОВЕДЕНИЯ ДОКУМЕНТА

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ТаблицыДляДвижений = Новый Структура;		
	ДополнительныеСвойства = Новый Структура;
	НомераТаблиц = Новый Структура;
	
	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	НомераТаблиц = Новый Структура;
	Запрос.Текст = ТекстЗапросаПлановыеПроценты(НомераТаблиц);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Для Каждого НомерТаблицы Из НомераТаблиц Цикл
		Если СтрНачинаетсяС(НомерТаблицы.Ключ, "Таблица") Тогда			
			Продолжить;
		КонецЕсли;
		ТаблицыДляДвижений.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
			
	ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", ТаблицыДляДвижений);
	
	Возврат ДополнительныеСвойства;

КонецФункции

Функция ТекстЗапросаПлановыеПроценты(НомераТаблиц)

	НомераТаблиц.Вставить("АСЦ_ПлановыеПроцентыКВ", НомераТаблиц.Количество());

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДокПроценты.Период КАК Период,
	|	ДокПроценты.Контрагент КАК Контрагент,
	|	ДокПроценты.Ссылка.Организация КАК Организация,
	|	ДокПроценты.ПродавецАвто КАК ПродавецАвто,
	|	ДокПроценты.ТипАвто КАК ТипАвто,
	|	ДокПроценты.ПроцентКВ КАК ПроцентКВ
	|ИЗ
	|	Документ.АСЦ_ПлановыеПроцентыКВ.Проценты КАК ДокПроценты
	|ГДЕ
	|	ДокПроценты.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса;

КонецФункции

#КонецЕсли
