
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	
	ДокументПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура ДокументПриИзмененииСервер()
	
	ДЦ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "ДоговорКонтрагента.ОсновнойЦФО");
	База = АСЦ_ПоискОбъектов.ПолучитьОсновнуюБазу(ДЦ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьОшибки(Команда)
	ПрочитатьОшибкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьОшибкиНаСервере()
	
	ТекстЗапроса =
	"SELECT
	|	[InsDate] as [Дата]
	|	,[ErrorMes] as [Сообщение]
	|FROM 
	|	[uho].[VW_UHSaleInsurance_ErrLog]
	|WHERE
	|	[UH_ID] = &ДокументГУИД
	|ORDER BY
	|	Дата DESC";
	
	ДокументГУИД = Строка(Документ.УникальныйИдентификатор());
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДокументГУИД", "'" + ДокументГУИД + "'");
	
	СтрокаСоединения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(База, "СтрокаПодключения");
	
	ТаблицаОшибок.Очистить();
	
	Соединение = Новый COMОбъект("ADODB.Connection");
	Соединение.Open(СтрокаСоединения);
	
	НаборЗаписей = Соединение.Execute(ТекстЗапроса);
	Если НЕ НаборЗаписей.EOF Тогда		

		НаборЗаписей.MoveFirst();
		Пока НЕ НаборЗаписей.EOF Цикл
			
			НоваяСтрока = ТаблицаОшибок.Добавить();
			НоваяСтрока.Дата      = НаборЗаписей.Fields("Дата").Value;
			НоваяСтрока.Сообщение = НаборЗаписей.Fields("Сообщение").Value;
			
			НаборЗаписей.MoveNext();
			
		КонецЦикла;
		
	КонецЕсли;
	
	НаборЗаписей.Close();
	
	Если ТаблицаОшибок.Количество() = 0 Тогда
		Текст = "Ошибок нет";
	Иначе
		Текст = "";
	КонецЕсли;	
	
КонецПроцедуры
