
&НаКлиенте
Процедура ЗаполнитьОрганизации(Команда)
	ЗаполнитьОрганизацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОрганизацииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Наименование", "ИП %");
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетнаяПолитикаСрезПоследних.Организация ЕСТЬ NULL КАК Пометка,
	|	Организации.Ссылка КАК Организация,
	|	НЕ УчетнаяПолитикаСрезПоследних.Организация ЕСТЬ NULL КАК УП,
	|	НастройкиСистемыНалогообложенияСрезПоследних.СистемаНалогообложения КАК СистемаНалогообложения,
	|	НастройкиСистемыНалогообложенияСрезПоследних.ОбъектНалогообложенияУСН КАК ОбъектНалогообложенияУСН
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитика.СрезПоследних КАК УчетнаяПолитикаСрезПоследних
	|		ПО (УчетнаяПолитикаСрезПоследних.Организация = Организации.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиСистемыНалогообложения.СрезПоследних КАК НастройкиСистемыНалогообложенияСрезПоследних
	|		ПО (НастройкиСистемыНалогообложенияСрезПоследних.Организация = Организации.Ссылка)
	|ГДЕ
	|	Организации.Наименование ПОДОБНО &Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организации.Наименование";
	
	ТаблицаОрганизаций.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУП(Команда)
	ЗаполнитьУПНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУПНаСервере()
	
	Дата = '2018-01-01';
	
	Для каждого СтрокаТЗ из ТаблицаОрганизаций Цикл
		
		Если НЕ СтрокаТЗ.Пометка Тогда
			Продолжить;
		КонецЕсли;	
		
		Запись = РегистрыСведений.УчетнаяПолитика.СоздатьМенеджерЗаписи();
		Запись.Период      = Дата;
		Запись.Организация = СтрокаТЗ.Организация;
		Запись.ОказаниеУслуг = Истина;
		Запись.ВариантБухгалтерскойОтчетности = Перечисления.ВариантыБухгалтерскойОтчетности.ОбщиеПравила;
		Запись.Записать();
		
		Запись = РегистрыСведений.НастройкиСистемыНалогообложения.СоздатьМенеджерЗаписи();
		Запись.Период      = Дата;
		Запись.Организация = СтрокаТЗ.Организация;
		Запись.СистемаНалогообложения   = Перечисления.СистемыНалогообложения.Упрощенная;
		Запись.ОбъектНалогообложенияУСН = Перечисления.ОбъектыНалогообложенияПоУСН.Доходы;
		Запись.ПрименяетсяУСНДоходы     = Истина;
		Запись.Записать();
		
	КонецЦикла;	
	
КонецПроцедуры
