Перем КонтекстЯдра;
Перем Ожидаем;
Перем Утверждения;
Перем ГенераторТестовыхДанных;
Перем ЗапросыИзБД;
Перем УтвержденияПроверкаТаблиц;

Перем ОбработкаОбъект;
Перем Параметры;
Перем СвойствоID;

#Область ЮнитТестирование

Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
	ГенераторТестовыхДанных = КонтекстЯдра.Плагин("СериализаторMXL");
	ЗапросыИзБД = КонтекстЯдра.Плагин("ЗапросыИзБД");
	УтвержденияПроверкаТаблиц = КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц");
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	
	НаборТестов.Добавить("Реализация_Основание");
	НаборТестов.Добавить("КритерийОтбора_СвязанныеДокументы");
	
КонецПроцедуры

Процедура ПередЗапускомТеста() Экспорт
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
	
КонецПроцедуры

Функция РазрешенСлучайныйПорядокВыполненияТестов() Экспорт
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

Процедура Реализация_Основание() Экспорт
	
	ТипРеквизита = Метаданные.Документы.РеализацияТоваровУслуг.Реквизиты.ДокументОснование.Тип;
	Результат = ТипРеквизита.СодержитТип(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	
	Утверждения.ПроверитьИстину(Результат, "РеализацияТоваровУслуг.ДокументОснование не содержит тип ДокументСсылка.РеализацияТоваровУслуг");
	
КонецПроцедуры

Процедура КритерийОтбора_СвязанныеДокументы() Экспорт
	
	СвязанныеДокументы = Метаданные.КритерииОтбора.СвязанныеДокументы;
	АСЦ_ОтчетПосредника = Метаданные.Документы.АСЦ_ОтчетПосредника;
	
	Реквизит = АСЦ_ОтчетПосредника.ТабличныеЧасти.Продажи.Реквизиты.Документ;
	Результат = СвязанныеДокументы.Состав.Содержит(Реквизит);
	Утверждения.ПроверитьИстину(Результат, "Критерий отбора на содержит реквизит АСЦ_ОтчетПосредника.Продажи.Документ");
	
	Реквизит = АСЦ_ОтчетПосредника.Реквизиты.ОтчетКомитентуОПродажах;
	Результат = СвязанныеДокументы.Состав.Содержит(Реквизит);
	Утверждения.ПроверитьИстину(Результат, "Критерий отбора на содержит реквизит АСЦ_ОтчетПосредника.ОтчетКомитентуОПродажах");
	
КонецПроцедуры
