#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// ПОДГОТОВКА ПАРАМЕТРОВ ПРОВЕДЕНИЯ ДОКУМЕНТА

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ТаблицыДляДвижений = Новый Структура;		
	ДополнительныеСвойства = Новый Структура;
	НомераТаблиц = Новый Структура;
	
	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",    ДокументСсылка);
	
	НомераТаблиц = Новый Структура;
	Запрос.Текст = ТекстЗапросаНачисленноеКВ(НомераТаблиц);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Для Каждого НомерТаблицы Из НомераТаблиц Цикл
		Если СтрНачинаетсяС(НомерТаблицы.Ключ, "Таблица") Тогда			
			Продолжить;
		КонецЕсли;
		ТаблицыДляДвижений.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
			
	ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", ТаблицыДляДвижений);
	
	Возврат ДополнительныеСвойства;

КонецФункции

Функция ТекстЗапросаНачисленноеКВ(НомераТаблиц)

	НомераТаблиц.Вставить("АСЦ_НачисленноеКВ", НомераТаблиц.Количество());

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Док.Ссылка.Дата КАК Период,
	|	Док.ДЦ КАК ДЦ,
	|	Док.Статья КАК Статья,
	|	Док.Ссылка.Контрагент КАК Комитент,
	|	Док.Ссылка.Организация КАК Организация,
	|	Док.Реализация КАК Реализация,
	|	Док.Документ КАК Документ,
	|	-ВЫБОР
	|		КОГДА Док.Ссылка.ВидОперации.ДвиженияСумма = ""Сумма""
	|			ТОГДА Док.СуммаПлан
	|		ИНАЧЕ Док.СуммаКВПлан
	|	КОНЕЦ КАК Сумма,
	|	-Док.СуммаКВПлан КАК СуммаКВ
	|ИЗ
	|	Документ.АСЦ_ОтчетПосредникаУпр.Продажи КАК Док
	|ГДЕ
	|	Док.Ссылка = &Ссылка
	|	И НЕ Док.Ссылка.ВидОперации.ФормироватьКорректировки
	|	И (Док.СуммаПлан > 0
	|			ИЛИ Док.СуммаКВПлан > 0)
	|	И (Док.Сумма <> Док.СуммаПлан
	|			ИЛИ Док.СуммаКВ <> Док.СуммаКВПлан)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Док.Ссылка.Дата,
	|	Док.ДЦ,
	|	Док.Статья,
	|	Док.Ссылка.Контрагент,
	|	Док.Ссылка.Организация,
	|	Док.Реализация,
	|	Док.Документ,
	|	ВЫБОР
	|		КОГДА Док.Ссылка.ВидОперации.ДвиженияСумма = ""Сумма""
	|			ТОГДА Док.Сумма
	|		ИНАЧЕ Док.СуммаКВ
	|	КОНЕЦ,
	|	Док.СуммаКВ
	|ИЗ
	|	Документ.АСЦ_ОтчетПосредникаУпр.Продажи КАК Док
	|ГДЕ
	|	Док.Ссылка = &Ссылка
	|	И НЕ Док.Ссылка.ВидОперации.ФормироватьКорректировки
	|	И (Док.Сумма > 0
	|			ИЛИ Док.СуммаКВ > 0)
	|	И (Док.Сумма <> Док.СуммаПлан
	|			ИЛИ Док.СуммаКВ <> Док.СуммаКВПлан)";
	
	Возврат ТекстЗапроса;

КонецФункции

#КонецЕсли
