
&НаКлиенте
Процедура тестИнициализацияОтчетов() Экспорт
	
	ИнициализацияОтчетов(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Функция тестТабДокСПоказателями() Экспорт
	
	Возврат тестТабДокСПоказателямиСервер();
	
КонецФункции

&НаСервере
Функция тестТабДокСПоказателямиСервер()
	
	ТабДокРезультат = Новый ТабличныйДокумент;
	ТабДокРезультат.Вывести(ТабДок);
	
	Для Счетчик1 = 1 По ТабДок.ВысотаТаблицы Цикл
		
		Для Счетчик2 = 1 По ТабДок.ШиринаТаблицы Цикл
			
			ТекОбласть = ТабДокРезультат.Область(Счетчик1, Счетчик2, Счетчик1, Счетчик2);
			Если НЕ ТекОбласть.СодержитЗначение Тогда
				Продолжить;
			КонецЕсли;	
			
			ТекЗначение = ТекОбласть.Значение;
			ТекОбласть.СодержитЗначение = Ложь;
			ТекОбласть.Текст = Формат(ТекЗначение, "ЧРД=.; ЧГ=0; ДФ=dd.MM.yyyy");
			
		КонецЦикла;
		
	КонецЦикла;	
	
	Возврат ТабДокРезультат;
	
КонецФункции

&НаКлиенте
Функция тестПолучитьМассивКолонок() Экспорт
	
	Возврат тестПолучитьМассивКолонокСервер();
	
КонецФункции	

&НаСервере
Функция тестПолучитьМассивКолонокСервер()
	
	МассивКолонок = Новый Массив;
	МассивРеквизитов = ПолучитьРеквизиты("ТабДерево");
	
	Для каждого Реквизит из МассивРеквизитов Цикл
		
		Если СтрНачинаетсяС(Реквизит.Имя, "_") Тогда
			СтрукутраКолонки = Новый Структура("Имя, Заголовок", Реквизит.Имя, Реквизит.Заголовок);
			МассивКолонок.Добавить(СтрукутраКолонки);
		КонецЕсли;	
		
	КонецЦикла;	
	
	Возврат МассивКолонок;	
	
КонецФункции	

&НаКлиенте
Процедура тестЗаполнитьДокументПоМакету(Форма, ТабОригинал, МассивКолонок) Экспорт
	
	СоответствиеКолонок = Новый Соответствие;
	Для каждого Колонка из МассивКолонок Цикл
		СоответствиеКолонок.Вставить(Колонка.Заголовок, Колонка.Имя);
	КонецЦикла;	
	
	СоответствиеКолонокОригинала = Новый Соответствие;
	Для Счетчик = 4 по ТабОригинал.ШиринаТаблицы Цикл
		Область = ТабОригинал.Область(3, Счетчик, 3, Счетчик);
		СоответствиеКолонокОригинала.Вставить(Счетчик, Область.Текст);
	КонецЦикла;	
	
	МассивСтрок = Новый Массив;
	РазвернутьДерево(ТабДерево.ПолучитьЭлементы(), МассивСтрок);
	
	Для Счетчик = 4 по ТабОригинал.ВысотаТаблицы Цикл
		
		ОбластьСтатья = ТабОригинал.Область(Счетчик, 2, Счетчик, 2);
		СтрокаДерева = МассивСтрок[Счетчик - 4];
		Если ОбластьСтатья.Текст <> Строка(СтрокаДерева.Группировка) Тогда
			Сообщить(ОбластьСтатья.Текст + ": " + Строка(СтрокаДерева.Группировка));
			Продолжить;
		КонецЕсли;	
		
		Для СчетчикШ = 4 по ТабОригинал.ШиринаТаблицы Цикл
			
			ОбластьЗначение = ТабОригинал.Область(Счетчик, СчетчикШ, Счетчик, СчетчикШ);
			Если Строка(ОбластьЗначение.ЦветФона) <> "Авто" Тогда 
				Продолжить;
			КонецЕсли;
			
			Значение = ОбластьЗначение.Текст;
			ИмяКолонки = СоответствиеКолонок[СоответствиеКолонокОригинала[СчетчикШ]];
			
			СтрокаДерева[ИмяКолонки] = Значение;
			
		КонецЦикла;	
		
	КонецЦикла;	
	
КонецПроцедуры	

&НаКлиентеНаСерверебезКонтекста
Процедура РазвернутьДерево(Строки, Массив) Экспорт
	
	Для каждого Строка из Строки Цикл
		
		Массив.Добавить(Строка);
		РазвернутьДерево(Строка.ПолучитьЭлементы(), Массив);
		
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Процедура тестПоказатьТабДокПосле(Команда)
	
	ТабдДокРезультат = тестТабДокСПоказателями();
	ТабдДокРезультат.Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура тестДействияФормыПоПравилуОбработки() Экспорт
	ДействияФормыПоПравилуОбработки(Неопределено);
КонецПроцедуры	

&НаКлиенте
Процедура тестВыводитьВДеревоЧислоПриИзменении() Экспорт
	ВыводитьВДеревоЧислоПриИзменении(Неопределено);
КонецПроцедуры	

&НаКлиенте
Процедура тестСнятьБлокировкуОтчетов() Экспорт
	СнятьБлокировкуОтчетов(РабочийОбъектАдрес);
КонецПроцедуры

&НаКлиенте
Процедура тестКоманднаяПанельРедактированиеЗаписать() Экспорт
	
	КоманднаяПанельРедактированиеЗаписать(Неопределено);
		
КонецПроцедуры
