
&Вместо("ЗаполнитьРеквизитыОбъекта")
Процедура АСЦ_ЗаполнитьРеквизитыОбъекта() Экспорт
	
	Если Не ПроверитьНаименование() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СтрокаПодключение=УправлениеСоединениямиВИБУХ.ПолучитьСтрокуСоединенияADO(Владелец.ВИБПоУмолчанию,,ИмяФайла);
	
	ПоляТаблицы = УправлениеСоединениямиВИБУХ.ВернутьКолонкиТаблицы(Наименование,СтрокаПодключение, Ложь);
	
	Реквизиты.Очистить();
	
	Для Каждого ПолеТаблицы Из ПоляТаблицы Цикл
		
		РеквизитТаблицы = Реквизиты.Добавить();
		РеквизитТаблицы.Имя = ПолеТаблицы.Имя;
		РеквизитТаблицы.ВнутреннееПредставление   = ПолеТаблицы.ВнутреннееПредставление; //+++Хижинков А.В. 8.11.2017 добавил строку РеквизитТаблицы.ВнутреннееПредставление   = ПолеТаблицы.ВнутреннееПредставление;
		РеквизитТаблицы.ТипЗначения = ПолеТаблицы.ОписаниеТипов;
		
	КонецЦикла;
	
	ТекТаблицаСвязей = УправлениеСоединениямиВИБУХ.ВернутьТаблицуСвязей(Наименование,СтрокаПодключение);
	СвязанныеТаблицы.Очистить();
	
	Для Каждого СвязаннаяТаблица Из ТекТаблицаСвязей Цикл
		
		ТекущаяТаблица = Справочники.ТаблицыADO.НайтиПоНаименованию(СвязаннаяТаблица.СвязаннаяТаблица, ,Владелец);
		Если ЗначениеЗаполнено(ТекущаяТаблица) Тогда
			НоваяСвязь = СвязанныеТаблицы.Добавить();
			НоваяСвязь.СвязаннаяТаблица = ТекущаяТаблица.Ссылка;
			НоваяСвязь.ПолеТекущейТаблицы = СвязаннаяТаблица.КолонкаТекущейТаблицы;
			НоваяСвязь.ПолеСвязаннойТаблицы = СвязаннаяТаблица.КолонкаСвязаннойТаблицы;
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры
