
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Адрес = "http://dtln-s-app1/uh-sitnikov/ws/wsOFU.1cws?wsdl";
	Пользователь = "ВыгрузкаОФУ";
	Пароль = "123456";
	
КонецПроцедуры

&НаКлиенте
Процедура ТестРеализации(Команда)
	ТестРеализацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестРеализацииНаСервере()
	
	Определение = Новый WSОпределения(Адрес, Пользователь, Пароль);
	Прокси = Новый WSПрокси(Определение, "http://www.ascgroup.ru/OFU", "АСЦ_ВыгрузкаОФУ", "АСЦ_ВыгрузкаОФУSoap");
	Прокси.Пользователь = Пользователь;
	Прокси.Пароль       = Пароль;
	Ответ = Прокси.Реализации(Период.ДатаНачала, Период.ДатаОкончания,Организация.ИНН,Организация.КПП);
	
КонецПроцедуры

&НаКлиенте
Процедура ТестОтчетПосредника(Команда)
	ТестОтчетПосредникаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестОтчетПосредникаНаСервере()
	
	Определение = Новый WSОпределения(Адрес, Пользователь, Пароль);
	Прокси = Новый WSПрокси(Определение, "http://www.ascgroup.ru/OFU", "АСЦ_ВыгрузкаОФУ", "АСЦ_ВыгрузкаОФУSoap");
	Прокси.Пользователь = Пользователь;
	Прокси.Пароль       = Пароль;
	Ответ = Прокси.ОтчетПосредника(Период.ДатаНачала, Период.ДатаОкончания,Организация.ИНН,Организация.КПП);
	
КонецПроцедуры

