
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Адрес = "http://dtln-s-app1/uh-sitnikov/ws/wsOFU.1cws?wsdl";
	Пользователь = "ВыгрузкаОФУ";
	Пароль = "123456";
	Вариант = "Модуль";
	
КонецПроцедуры

&НаКлиенте
Процедура ТестРеализации(Команда)
	
	Колво = ТестРеализацииНаСервере();
	Состояние("Ответ получен: " + Колво + " документов");
	
КонецПроцедуры

&НаСервере
Функция ТестРеализацииНаСервере()
	
	Если Вариант = "Модуль" Тогда
		
		Ответ = АСЦ_ВебСервисы.ВыгрузкаОФУ_Реализации(Период.ДатаНачала, Период.ДатаОкончания, Организация.ИНН, Организация.КПП, Ложь);
		
	Иначе	
		
		Определение = Новый WSОпределения(Адрес, Пользователь, Пароль);
		Прокси = Новый WSПрокси(Определение, "http://www.ascgroup.ru/OFU", "АСЦ_ВыгрузкаОФУ", "АСЦ_ВыгрузкаОФУSoap");
		Прокси.Пользователь = Пользователь;
		Прокси.Пароль       = Пароль;
		Ответ = Прокси.Реализации(Период.ДатаНачала, Период.ДатаОкончания,Организация.ИНН,Организация.КПП,);
		
	КонецЕсли;
	
	Возврат Ответ.Документы.Количество();
	
КонецФункции

&НаКлиенте
Процедура ТестОтчетПосредника(Команда)
	
	Колво = ТестОтчетПосредникаНаСервере();
	Состояние("Ответ получен: " + Колво + " документов");
	
КонецПроцедуры

&НаСервере
Функция ТестОтчетПосредникаНаСервере()
	
	Если Вариант = "Модуль" Тогда
		
		Ответ = АСЦ_ВебСервисы.ВыгрузкаОФУ_ОтчетПосредника(Период.ДатаНачала, Период.ДатаОкончания, Организация.ИНН, Организация.КПП, Ложь);
		
	Иначе	
		
		Определение = Новый WSОпределения(Адрес, Пользователь, Пароль);
		Прокси = Новый WSПрокси(Определение, "http://www.ascgroup.ru/OFU", "АСЦ_ВыгрузкаОФУ", "АСЦ_ВыгрузкаОФУSoap");
		Прокси.Пользователь = Пользователь;
		Прокси.Пароль       = Пароль;
		Ответ = Прокси.ОтчетПосредника(Период.ДатаНачала, Период.ДатаОкончания,Организация.ИНН,Организация.КПП,);
		
	КонецЕсли;
	
	Возврат Ответ.Документы.Количество();
	
КонецФункции

