
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	База = Справочники.ВнешниеИнформационныеБазы.НайтиПоНаименованию("Юникус");
	
	ДатаНачала = '2016-01-01';
	
КонецПроцедуры

&НаКлиенте
Процедура Прочитать(Команда)
	ПрочитатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаСервере()
	
	СтрокаСоединения = УправлениеСоединениямиВИБУХ.ПолучитьСтрокуСоединенияADO(База);
	
	ТекстЗапроса = 
	"SELECT DISTINCT
	|	DEPARTMENT_NAME
	|FROM
	|	V_ASC_CONTRACT
	|WHERE
	|	DATE_SIGN >= &ДатаНач
	|ORDER BY
	|	1";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДатаНач", ИнтеграцияСВнешнимиСистемамиУХ.АСЦ1_асцПолучитьТекстПараметра(ДатаНачала, "Oracle"));
	
	Соединение = Новый COMОбъект("ADODB.Connection");
	Соединение.Open(СтрокаСоединения);
	
	мНаборЗаписей = Соединение.Execute(ТекстЗапроса);
	
	ТаблицаДанных.Очистить();
	
	Пока НЕ мНаборЗаписей.EOF Цикл
			
		НоваяСтрока = ТаблицаДанных.Добавить();
		НоваяСтрока.Наименование = мНаборЗаписей.Fields("DEPARTMENT_NAME").Value;
		
		мНаборЗаписей.MoveNext();
		
	КонецЦикла;	
	
	мНаборЗаписей.Close();
	
	Настройка = Справочники.СоответствиеВнешнимИБ.НайтиПоНаименованию("DEPARTMENTS <-> Организации",, База.Владелец);
	Для каждого СтрокаТЗ из ТаблицаДанных Цикл
		СтрокаТЗ.Организация = ПолучитьОрганизацию(СтрокаТЗ.Наименование, Настройка);
	КонецЦикла;	
	
	Элементы.ТаблицаДанныхЗаписать.КнопкаПоУмолчанию = Истина;
	
КонецПроцедуры

Функция ПолучитьОрганизацию(Наименование, Настройка)
	
	//СпрСсылка = РегистрыСведений.АСЦ_СоответствиеПодразделенийUnicus.ПолучитьОрганизацию(Наименование);
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Наименование", Наименование);
	Запрос.Параметры.Вставить("База",         База);
	Запрос.Параметры.Вставить("Настройка",    Настройка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Рег.ОбъектТекущейИБ КАК ОбъектТекущейИБ
	|ИЗ
	|	РегистрСведений.СоответствиеОбъектовТекущейИВнешнихИБ КАК Рег
	|ГДЕ
	|	Рег.ОбъектВнешнейИБ = &Наименование
	|	И Рег.НастройкаСоответствия = &Настройка
	|	И Рег.ИспользуемаяИБ = &База";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат.Выгрузить()[0][0];
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
Процедура ТаблицаОрганизацияПриИзменении(Элемент)
	
	Элементы.ТаблицаДанных.ТекущиеДанные.Изменен = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "НаименованиеUNICUS");
	
	Настройка = Справочники.СоответствиеВнешнимИБ.НайтиПоНаименованию("DEPARTMENTS <-> Организации",, База.Владелец);
	
	Для каждого СтрокаТЗ из ТаблицаДанных Цикл
		
		Если НЕ СтрокаТЗ.Изменен Тогда
			Продолжить;
		КонецЕсли;	
		
		//Если НЕ ЗначениеЗаполнено(СтрокаТЗ.Организация) Тогда
		//	Продолжить;
		//КонецЕсли;	
		
		//РегистрыСведений.АСЦ_СоответствиеПодразделенийUnicus.ЗаписатьСоответствие(СтрокаТЗ.Наименование, СтрокаТЗ.Организация);
		//Запись = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
		//Запись.Объект   = СтрокаТЗ.Организация;
		//Запись.Свойство = Свойство;
		//Запись.Значение = СтрокаТЗ.Наименование;
		//Запись.Записать();
		
		Запись = РегистрыСведений.СоответствиеОбъектовТекущейИВнешнихИБ.СоздатьМенеджерЗаписи();
		Запись.ОбъектТекущейИБ = СтрокаТЗ.Организация;
		Запись.ИспользуемаяИБ  = База;
		Запись.ОбъектВнешнейИБ = СтрокаТЗ.Наименование;
		Запись.НастройкаСоответствия = Настройка;
		Запись.Записать();
		
		СтрокаТЗ.Изменен = Ложь;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокОрганизаций()
	
	Список = Новый СписокЗначений;
	Список.Добавить(Справочники.Организации.НайтиПоНаименованию("Центры из АСТРЫ"));
	
	Возврат Список;
	
КонецФункции

&НаКлиенте
Процедура ПрочитатьИзРегистра(Команда)
	ПрочитатьИзРегистраНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьИзРегистраНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Рег.Наименование КАК Наименование,
	|	Рег.Организация КАК Организация,
	|	ИСТИНА КАК Изменен
	|ИЗ
	|	РегистрСведений.АСЦ_СоответствиеПодразделенийUnicus КАК Рег";
	
	ТаблицаДанных.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
