
Функция СведенияОВнешнейОбработке() Экспорт

	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.1.3.1");
	
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия = Метаданные().Комментарий;
	ПараметрыРегистрации.БезопасныйРежим = Ложь;
	ПараметрыРегистрации.Информация = "Загрузка данных из UNICUS в экземпляр отчета за текущий месяц по всем организациям";
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = Метаданные().Представление() + " - Открыть форму";
	НоваяКоманда.Идентификатор = Метаданные().Имя + "Форма";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	НоваяКоманда.ПоказыватьОповещение = Ложь;
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = "Загрузить отчет UNICUS 'Прямые расчеты с СК'";
	НоваяКоманда.Идентификатор = "ЗагрузитьОтчетUNICUS_Contracts";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	НоваяКоманда.ПоказыватьОповещение = Ложь;

	Возврат ПараметрыРегистрации;

КонецФункции

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыКоманды = Неопределено) Экспорт 
	
	ВИБ = ХранилищеОбщихНастроек.Загрузить("ЗагрузитьОтчетUNICUS", "ВИБ");
	Если НЕ ЗначениеЗаполнено(ВИБ) Тогда
		ВИБ    = Справочники.ВнешниеИнформационныеБазы.НайтиПоНаименованию("Юникус");
	КонецЕсли;
	
	Период = ПолучитьТекущийПериод();
	
	//ЗаписьЖурналаРегистрации("Загрузка отчета UNICUS",
	//	УровеньЖурналаРегистрации.Предупреждение,,, "Параметры: " + вСтроку(ПараметрыКоманды));
	
	Если ИдентификаторКоманды = "ЗагрузитьОтчетUNICUS_Contracts" Тогда
		ЗагрузитьContracts();
	КонецЕсли;	
	
КонецПроцедуры	

Функция вСтроку(ПараметрыКоманды)
	
	Если ПараметрыКоманды = Неопределено Тогда
		Возврат "";
	ИначеЕсли ТипЗнч(ПараметрыКоманды) = Тип("Структура")
		ИЛИ ТипЗнч(ПараметрыКоманды) = Тип("Соответствие") Тогда
		
		Рез = "";
		Для каждого КлючИЗначение из ПараметрыКоманды Цикл
			Рез = Рез + Символы.ПС + Строка(КлючИЗначение.Ключ) + ": " + вСтроку(КлючИЗначение.Значение);
		КонецЦикла;	
		
		Возврат Рез;
		
	Иначе
		Возврат Строка(ПараметрыКоманды);
	КонецЕсли;	
	
КонецФункции	

Процедура ЗагрузитьContracts() Экспорт
	
	// Если соединение уже закрыто, но ссылка на него осталась
	ОбновитьПовторноИспользуемыеЗначения();
	
	ПараметрыПодключения = Новый Структура;
	Соединение = УправлениеСоединениямиВИБУХ.ПолучитьСоединениеADO(ВИБ,ПараметрыПодключения);
	
	ТипБазы   = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВИБ, "ТипБД"); 
	НастройкаДепартаменты = Справочники.СоответствиеВнешнимИБ.НайтиПоНаименованию("DEPARTMENTS <-> Организации",,, ТипБазы);
	
	// Выберем все встречающиеся организации и для каждой сформируем документ
	ТекстЗапроса =
	"SELECT DISTINCT
	|	tab.DEPARTMENT_NAME as ЦФО
	|FROM 
	|	unicusweb_release.v_asc_pay_contract tab
	|WHERE
	|	tab.PAY_DATE BETWEEN &ДатаНач AND &ДатаКон
	|	AND tab.PAY_TYPE = 'Прямые расчеты с СК'";
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		ЦФО = АСЦ_ПоискОбъектов.ПолучитьЗначениеВнешнейИБ(Организация, НастройкаДепартаменты, ВИБ); 
		ТекстЗапроса = ТекстЗапроса + "
		|	AND tab.DEPARTMENT_NAME = '" + ЦФО + "'";
		
	КонецЕсли;	
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДатаНач", ИнтеграцияСВнешнимиСистемамиУХ.АСЦ1_асцПолучитьТекстПараметра(Период.ДатаНачала, "Oracle"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДатаКон", ИнтеграцияСВнешнимиСистемамиУХ.АСЦ1_асцПолучитьТекстПараметра(КонецДня(Период.ДатаОкончания), "Oracle"));
	
	
	ВидОтчета = Справочники.ВидыОтчетов.НайтиПоКоду("UNICUS_Contracts");
	Сценарий  = Справочники.Сценарии.Факт;
	
	Таблица = АСЦ_ОбщийМодуль.ВыполнитьЗапросADO(Соединение, ТекстЗапроса);
	
	ОшибкиОрганизация = "";
	
	КэшДанных = Новый Соответствие;
	Для каждого СтрокаТЗ из Таблица Цикл
		
		текЦФО = АСЦ_ПоискОбъектов.ПолучитьОбъектПоСоотвествию(СтрокаТЗ.ЦФО, НастройкаДепартаменты, ВИБ, КэшДанных);
		
		Если Не ЗначениеЗаполнено(текЦФО) Тогда
			ОшибкиОрганизация = ОшибкиОрганизация + Символы.ПС + 
			СтрокаТЗ.ЦФО;
			Продолжить;
		КонецЕсли;	
		
		Сообщить(текЦФО);
		СоздатьИЗаполнитьДокумент(текЦФО, ВидОтчета, Сценарий);
		
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(ОшибкиОрганизация) Тогда
		Сообщить("Не найдена организация: " + ОшибкиОрганизация);
		ЗаписьЖурналаРегистрации("Загрузка отчета UNICUS Прямые расчеты с СК",
			УровеньЖурналаРегистрации.Предупреждение,,, "Не найдена организация: " + ОшибкиОрганизация);
	КонецЕсли;
	
КонецПроцедуры	

Процедура СоздатьИЗаполнитьДокумент(текОрганизация, ВидОтчета, Сценарий)
	
	ДокументСсылка = ПолучитьЭкземплярОтчета(текОрганизация, ВидОтчета, Сценарий);
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		ДокументОбъект.ПометкаУдаления = Ложь;
	Иначе
		ДокументОбъект = Документы.НастраиваемыйОтчет.СоздатьДокумент();
		ДокументОбъект.Дата         = ТекущаяДата();
		ДокументОбъект.ПериодОтчета = Период;
		ДокументОбъект.Организация  = текОрганизация;
		ДокументОбъект.ВидОтчета    = ВидОтчета;
		ДокументОбъект.Сценарий     = Сценарий;
		ДокументОбъект.ОсновнаяВалюта = Константы.ВалютаРегламентированногоУчета.Получить();
		ДокументОбъект.СпособФормированияОтчета = Перечисления.СпособыФормированияОтчетов.АвтоматическиПоПравилуОбработки;
	КонецЕсли;	
	
	БланкОтчета = УправлениеОтчетамиУХ.НайтиПараметрОтчета(Перечисления.ЭлементыНастройкиОтчета.БланкДляОтображения, ВидОтчета, Сценарий, Организация, Период);
	ДокументОбъект.ПравилоОбработки = УправлениеОтчетамиУХ.НайтиПараметрОтчета(Перечисления.ЭлементыНастройкиОтчета.ПравилоОбработки, ВидОтчета, Сценарий, Организация, Период);
	ДокументОбъект.ПравилоПроверки  = УправлениеОтчетамиУХ.НайтиПараметрОтчета(Перечисления.ЭлементыНастройкиОтчета.ПравилоПроверки, ВидОтчета, Сценарий, Организация, Период);
	ДокументОбъект.ИспользуемаяИБ   = ВИБ;
	ДокументОбъект.СпособВывода     = "Бланк";
	ДокументОбъект.ШаблонОтчета     = БланкОтчета;
	ДокументОбъект.УровеньТочности  = 2;
	
	ДокументОбъект.ИнициализироватьКонтекст();
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		ДокументОбъект.ОчиститьРегистры();
	КонецЕсли;	
	
	Если Отладка Тогда
		ДокументОбъект.ДополнительныеСвойства.Вставить("Тест_КоличествоСтрок", 10);
	КонецЕсли;
	
	ДокументОбъект.ЗаполнитьОтчетПоУмолчанию();
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		Сообщить(ОписаниеОшибки);
		ЗаписьЖурналаРегистрации("Загрузка отчета " + ВидОтчета,
			УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки);
	КонецПопытки;	
	
КонецПроцедуры	

Функция ПолучитьОрганизацию(Наименование, ИНН = "")
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Наименование", Наименование);
	Запрос.Параметры.Вставить("ИНН",          ИНН);
	
	Если ЗначениеЗаполнено(ИНН) Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Спр.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Спр
		|ГДЕ
		|	Спр.ИНН = &ИНН";
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат Справочники.Организации.ПустаяСсылка();
		Иначе
			Возврат Результат.Выгрузить()[0][0];
		КонецЕсли;	
		
	КонецЕсли;	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Рег.Объект КАК Ссылка
	|ИЗ
	|	РегистрСведений.ДополнительныеСведения КАК Рег
	|ГДЕ
	|	Рег.Свойство.Имя = ""НаименованиеUNICUS""
	|	И Рег.Значение = &Наименование";
		
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Возврат Результат.Выгрузить()[0][0];
	КонецЕсли;	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Спр.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Организации КАК Спр
	|ГДЕ
	|	Спр.Наименование = &Наименование";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Справочники.Организации.ПустаяСсылка();
	Иначе
		Возврат Результат.Выгрузить()[0][0];
	КонецЕсли;	
	
КонецФункции	

Функция ПолучитьЭкземплярОтчета(текОрганизация, ВидОтчета, Сценарий)
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Организация",  текОрганизация);
	Запрос.Параметры.Вставить("ПериодОтчета", Период);
	Запрос.Параметры.Вставить("ВидОтчета",    ВидОтчета);
	Запрос.Параметры.Вставить("Сценарий",     Сценарий);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Док.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.НастраиваемыйОтчет КАК Док
	|ГДЕ
	|	Док.ПериодОтчета = &ПериодОтчета
	|	И Док.Организация = &Организация
	|	И Док.ВидОтчета = &ВидОтчета
	|	И Док.Сценарий = &Сценарий";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат.Выгрузить()[0][0];
	КонецЕсли;	
	
КонецФункции	

Функция ПолучитьТекущийПериод()
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Периодичность", Перечисления.Периодичность.Месяц);
	Запрос.Параметры.Вставить("ДатаНачала",    НачалоМесяца(ТекущаяДата()));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Спр.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Периоды КАК Спр
	|ГДЕ
	|	Спр.Периодичность = &Периодичность
	|	И Спр.ДатаНачала = &ДатаНачала";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Возврат Результат.Выгрузить()[0][0];
	Иначе
		Возврат Справочники.Периоды.ПустаяСсылка();
	КонецЕсли;	
	
КонецФункции	