
Функция ПолучитьДанныеДокументаРТУ(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Ссылка",            ДокументСсылка);
	Запрос.Параметры.Вставить("СвойствоСтраховая", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "Страховая"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Дата КАК Дата,
	|	Док.Номер КАК Номер,
	|	Док.Организация КАК Организация,
	|	Док.Организация.ИНН КАК ОрганизацияИНН,
	|	Док.Организация.КПП КАК ОрганизацияКПП,
	|	Док.Контрагент КАК Контрагент,
	|	Док.Контрагент.Наименование КАК КонтрагентНаименование,
	|	Док.Контрагент.ИНН КАК КонтрагентИНН,
	|	Док.Контрагент.КПП КАК КонтрагентКПП,
	|	Док.Контрагент.ДокументУдостоверяющийЛичность КАК КонтрагентПаспорт,
	|	Док.ДоговорКонтрагента КАК Договор,
	|	Док.ДоговорКонтрагента.Наименование КАК ДоговорНаименование,
	|	Док.ДоговорКонтрагента.Дата КАК ДоговорДата,
	|	Док.ДоговорКонтрагента.ДатаНачала КАК ДоговорДатаНачала,
	|	Док.ДоговорКонтрагента.СрокДействия КАК ДоговорСрокДействия,
	|	Док.ДоговорКонтрагента.ОсновнойЦФО.Наименование КАК ЦФО,
	|	Док.СуммаДокумента КАК Сумма,
	|	ЕСТЬNULL(ДокАгентскиеУслуги.Номенклатура, ДокУслуги.Номенклатура) КАК Номенклатура,
	|	СпрНоменклатура.Наименование КАК НоменклатураНаименование,
	|	СпрНоменклатура.НоменклатурнаяГруппа.Наименование КАК НоменклатураНГ,
	|	Страховые.Ссылка КАК Страховая,
	|	ЕСТЬNULL(Страховые.ИНН, """") КАК СтраховаяИНН,
	|	ЕСТЬNULL(Страховые.КПП, """") КАК СтраховаяКПП,
	|	ЕСТЬNULL(Страховые.Наименование, """") КАК СтраховаяНаименование,
	|	ЕСТЬNULL(ДокАгентскиеУслуги.Сумма, 0) КАК СуммаАгенскиеУслуги,
	|	ЕСТЬNULL(ДокУслуги.Сумма, 0) КАК СуммаУслуги
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК ДокУслуги
	|		ПО (ДокУслуги.Ссылка = Док.Ссылка)
	|			И (ДокУслуги.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК ДокАгентскиеУслуги
	|		ПО (ДокАгентскиеУслуги.Ссылка = Док.Ссылка)
	|			И (ДокАгентскиеУслуги.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО (ЕСТЬNULL(ДокАгентскиеУслуги.Номенклатура, ДокУслуги.Номенклатура) = СпрНоменклатура.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов.ДополнительныеРеквизиты КАК ДоговорыСтраховая
	|		ПО Док.ДоговорКонтрагента = ДоговорыСтраховая.Ссылка
	|			И (ДоговорыСтраховая.Свойство = &СвойствоСтраховая)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Страховые
	|		ПО (ДоговорыСтраховая.Значение = Страховые.Ссылка)
	|ГДЕ
	|	Док.Ссылка = &Ссылка";
	
	Возврат Запрос.Выполнить().Выгрузить()[0];
	
КонецФункции	

Функция Реализации(ДатаНач, ДатаКон, ОрганизацияГУИД)
	
	СписокРТУ = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.ascgroup.ru/OFU", "СписокРТУ"));
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Параметры.Вставить("Дата1",       ДатаНач);
	Запрос.Параметры.Вставить("Дата2",       ДатаКон);
	Запрос.Параметры.Вставить("Комментарий", "Прямые расчеты с СК");
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 20
	|	Док.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Док
	|ГДЕ
	|	Док.Проведен
	|	И Док.Дата МЕЖДУ &Дата1 И &Дата2
	|	И НЕ Док.Комментарий ПОДОБНО &Комментарий
	|{ГДЕ
	|	Док.Организация}";
	
	Если ЗначениеЗаполнено(ОрганизацияГУИД) Тогда
		
		Организация = Справочники.Организации.ПолучитьСсылку(Новый УникальныйИдентификатор(ОрганизацияГУИД));
		
		ЭлементОтбора = Запрос.Отбор.Добавить("Организация");
		ЭлементОтбора.Установить(Организация, Истина);
		
	КонецЕсли;	
	
	Запрос.Выполнить();
	Выборка = Запрос.Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Данные = ПолучитьДанныеДокументаРТУ(Выборка.Ссылка);
		
		Документ = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.ascgroup.ru/OFU", "РТУ"));
		Документ.ГУИД  = Строка(Выборка.Ссылка.УникальныйИдентификатор());
		Документ.Дата  = Данные.Дата;
		Документ.Номер = Данные.Номер;
		Документ.Тип   = "Реализация";
		
		// Организация
		пОрганизация = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.ascgroup.ru/OFU", "Организация"));
		пОрганизация.ГУИД = Строка(Данные.Организация.УникальныйИдентификатор());
		пОрганизация.ИНН  = Данные.ОрганизацияИНН;
		пОрганизация.КПП  = Данные.ОрганизацияКПП;
		
		Документ.Организация = пОрганизация;
		
		// Контрагент
		пКонтрагент = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.ascgroup.ru/OFU", "Контрагент"));
		пКонтрагент.ГУИД         = Строка(Данные.Контрагент.УникальныйИдентификатор());
		пКонтрагент.Наименование = Данные.КонтрагентНаименование;
		пКонтрагент.ИНН          = Данные.КонтрагентИНН;
		пКонтрагент.КПП          = Данные.КонтрагентКПП;
		пКонтрагент.Паспорт      = Данные.КонтрагентПаспорт;

		Документ.Контрагент = пКонтрагент;
		
		// Договор
		пДоговор = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.ascgroup.ru/OFU", "Договор"));
		пДоговор.ГУИД         = Строка(Данные.Договор.УникальныйИдентификатор());
		пДоговор.Наименование = Данные.ДоговорНаименование;
		пДоговор.Дата         = Данные.ДоговорДата;
		пДоговор.ДатаНачала   = Данные.ДоговорДатаНачала;
		пДоговор.СрокДействия = Данные.ДоговорСрокДействия;
		
		Документ.Договор = пДоговор;
		
		// Страховая
		пСтраховая = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.ascgroup.ru/OFU", "Контрагент"));
		пСтраховая.ГУИД         = ?(ЗначениеЗаполнено(Данные.Страховая), Строка(Данные.Страховая.УникальныйИдентификатор()), "");
		пСтраховая.Наименование = Данные.СтраховаяНаименование;
		пСтраховая.ИНН          = Данные.СтраховаяИНН;
		пСтраховая.КПП          = Данные.СтраховаяКПП;

		Документ.Страховая = пСтраховая;
		
		// Номенклатура
		пНоменклатура = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип("http://www.ascgroup.ru/OFU", "Номенклатура"));
		пНоменклатура.Наименование         = Данные.НоменклатураНаименование;
		пНоменклатура.НоменклатурнаяГруппа = Данные.НоменклатураНГ;
		
		Документ.Номенклатура = пНоменклатура;
		
		Документ.ДЦ      = Данные.ЦФО;
		Документ.Сумма   = Данные.СуммаУслуги + Данные.СуммаАгенскиеУслуги;
		Документ.СуммаКВ = Данные.СуммаУслуги;
		
		СписокРТУ.Документы.Добавить(Документ);
		
	КонецЦикла;	
	
	Возврат СписокРТУ;
	
КонецФункции

Функция ОтчетПосредника()
	// Вставить содержимое обработчика.
КонецФункции
