
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Адрес = "http://dtln-s-app1/uh-sitnikov/ws/payments.1cws?wsdl";
	Пользователь = "ВыгрузкаВАстра";
	Пароль = "123456";
	Вариант = "Модуль";
	
КонецПроцедуры

&НаКлиенте
Процедура ТестВебСервис(Команда)
	
	Колво = ТестВебСервисНаСервере();
	Состояние("Ответ получен: " + Колво + " документов");
	
КонецПроцедуры

&НаСервере
Функция ТестВебСервисНаСервере()
	
	Если Вариант = "Модуль" Тогда
		
		Ответ = ASCPayments.getPayments(1, Период.ДатаНачала, Период.ДатаОкончания);
		
	Иначе	
		
		Определение = Новый WSОпределения(Адрес, Пользователь, Пароль);
		Прокси = Новый WSПрокси(Определение, "http://www.ascgroup.ru/payments", "ASCPayments", "ASCPaymentsSoap");
		Прокси.Пользователь = Пользователь;
		Прокси.Пароль       = Пароль;
		Ответ = Прокси.getPayments(1, Период.ДатаНачала, Период.ДатаОкончания);
		
	КонецЕсли;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, Ответ);
	Текст = ЗаписьXML.Закрыть();
	
	Возврат Ответ.payment.Количество();
	
КонецФункции
