&НаКлиенте
Перем КонтекстЯдра;
&НаКлиенте
Перем Ожидаем;
&НаКлиенте
Перем Утверждения;
&НаКлиенте
Перем ГенераторТестовыхДанных;
&НаКлиенте
Перем ЗапросыИзБД;
&НаКлиенте
Перем УтвержденияПроверкаТаблиц;

&НаКлиенте
Перем Форма;

#Область ЮнитТестирование

&НаКлиенте
Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	
	КонтекстЯдра = КонтекстЯдраПараметр;
	Ожидаем = КонтекстЯдра.Плагин("УтвержденияBDD");
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
	ГенераторТестовыхДанных = КонтекстЯдра.Плагин("СериализаторMXL");
	ЗапросыИзБД = КонтекстЯдра.Плагин("ЗапросыИзБД");
	УтвержденияПроверкаТаблиц = КонтекстЯдра.Плагин("УтвержденияПроверкаТаблиц");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаборТестов(НаборТестов) Экспорт
	НаборТестов.Добавить("Тест_v_asc_contract");
	НаборТестов.Добавить("Тест_v_asc_act");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗапускаТеста() Экспорт
	
	Попытка
		Форма.Записать();
		Форма.Закрыть();
	Исключение
	КонецПопытки;	
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Тест_v_asc_contract() Экспорт
	
	Макет = ПолучитьМакет("ДанныеContract");
	СтруктураДанных = ГенераторТестовыхДанных.СоздатьДанныеПоТабличномуДокументу(Макет,,, Истина);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", СтруктураДанных.НастраиваемыйОтчет1);
	ПараметрыФормы.Вставить("Тест_КоличествоСтрок", 10);
	
	Форма = ПолучитьФорму("Документ.НастраиваемыйОтчет.ФормаОбъекта", ПараметрыФормы);
	Форма.Открыть();
	
	Форма.тестВключитьРедактирование();
	Форма.тестДействияФормыРаскрытиеВБланке();
	
	Форма.ДействияФормыОчиститьЗавершение(КодВозвратаДиалога.Да, Неопределено);
	
	Форма.ВычислятьПриИзменении = Ложь;
	Форма.Элементы.ДействияФормыВычислятьПриИзменении.Пометка = Ложь;
	
	Форма.тестЗаполнитьПоУмолчанию();
	
	// В незаполненном отчете - 28 строк
	ТабДокумент = Форма.тестТабДокСПоказателями();
	Утверждения.ПроверитьБольшеИлиРавно(ТабДокумент.ВысотаТаблицы, 38, "Не заполнена таблица");
	
КонецПроцедуры	

&НаКлиенте
Процедура Тест_v_asc_act() Экспорт
	
	Макет = ПолучитьМакет("ДанныеAct");
	СтруктураДанных = ГенераторТестовыхДанных.СоздатьДанныеПоТабличномуДокументу(Макет,,, Истина);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", СтруктураДанных.НастраиваемыйОтчет1);
	ПараметрыФормы.Вставить("Тест_КоличествоСтрок", 10);
	
	Форма = ПолучитьФорму("Документ.НастраиваемыйОтчет.ФормаОбъекта", ПараметрыФормы);
	Форма.Открыть();
	
	Форма.тестВключитьРедактирование();
	Форма.тестДействияФормыРаскрытиеВБланке();
	
	Форма.ДействияФормыОчиститьЗавершение(КодВозвратаДиалога.Да, Неопределено);
	
	Форма.ВычислятьПриИзменении = Ложь;
	Форма.Элементы.ДействияФормыВычислятьПриИзменении.Пометка = Ложь;
	
	// Настройки по умолчанию хранятся в регистре НастройкаОбработкиОтчетов
	// Элемент "Спосо формирования" = "Расчет"
	Форма.тестЗаполнитьПоУмолчанию();
	
	// В незаполненном отчете - 14 строк
	ТабДокумент = Форма.тестТабДокСПоказателями();
	Утверждения.ПроверитьБольшеИлиРавно(ТабДокумент.ВысотаТаблицы, 24, "Не заполнена таблица");
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьМакет(ИмяМакета = "Данные")
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ПолучитьМакет(ИмяМакета);
	
КонецФункции
	