
Функция СуммаПроизведение(ДокументОбъект, КодПоказателяЗначение, КодПоказателяКоличество, ИтогоКоличество = 0) Экспорт
	
	ТаблицаЗначение = ДокументОбъект.ТаблицаТекущихЗначенийПоказателей(КодПоказателяЗначение);
	ТаблицаКоличество = ДокументОбъект.ТаблицаТекущихЗначенийПоказателей(КодПоказателяКоличество);
	
	СтруктураОтбора = Новый Структура("Аналитика1, Аналитика2, Аналитика3");
	
	ИтогоСумма      = 0;
	ИтогоКоличество = 0;
	Для каждого СтрокаЗначение из ТаблицаЗначение Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаЗначение);

		НайденныеСтроки = ТаблицаКоличество.НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;	
		
		СтрокаКоличество = НайденныеСтроки[0];
 		ИтогоСумма      = ИтогоСумма      + СтрокаЗначение.Значение * СтрокаКоличество.Значение;
		ИтогоКоличество = ИтогоКоличество + СтрокаКоличество.Значение;
		
	КонецЦикла;

	Возврат ИтогоСумма;
	
КонецФункции

Функция Средневзвешанное(ДокументОбъект, КодПоказателяЗначение, КодПоказателяКоличество) Экспорт
	
	ИтогоКоличество = 0;
	ИтогоСумма = СуммаПроизведение(ДокументОбъект, КодПоказателяЗначение, КодПоказателяКоличество, ИтогоКоличество);
	
	ТаблицаЗначение = ДокументОбъект.ТаблицаТекущихЗначенийПоказателей(КодПоказателяЗначение);
	ТаблицаКоличество = ДокументОбъект.ТаблицаТекущихЗначенийПоказателей(КодПоказателяКоличество);
	
	Если ИтогоКоличество = 0 Тогда
		Возврат 0;
	Иначе	
		Возврат ИтогоСумма / ИтогоКоличество;
	КонецЕсли;	
	
КонецФункции	

Функция НайтиКонтрагента(Наименование, ИНН, КПП, ТекстОшибки = "") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Наименование", Наименование);
	Запрос.Параметры.Вставить("ИНН",          ИНН);
	Запрос.Параметры.Вставить("КПП",          КПП);
	
	Если ЗначениеЗаполнено(ИНН) Тогда
		
		Если ЗначениеЗаполнено(КПП) Тогда
			
			Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Спр.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Контрагенты КАК Спр
			|ГДЕ
			|	НЕ Спр.ЭтоГруппа
			|	И НЕ Спр.ПометкаУдаления
			|	И Спр.ИНН = &ИНН
			|	И Спр.КПП = &КПП";
			
			Результат = Запрос.Выполнить();
			Если НЕ Результат.Пустой() Тогда
				Возврат Результат.Выгрузить()[0][0];
			КонецЕсли;
		
		КонецЕсли;
		
		// Возможно в КПП Ошибка или не указан, поищем по ИНН
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 2
		|	Спр.Ссылка КАК Ссылка,
		|	Спр.КПП КАК КПП
		|ИЗ
		|	Справочник.Контрагенты КАК Спр
		|ГДЕ
		|	НЕ Спр.ЭтоГруппа
		|	И НЕ Спр.ПометкаУдаления
		|	И Спр.ИНН = &ИНН";
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат Справочники.Контрагенты.ПустаяСсылка();
		Иначе
			
			Таблица = Результат.Выгрузить();
			Если Таблица.Количество() = 2 Тогда
				// Более 1 контрагента с одинаковым ИНН
				Если ЗначениеЗаполнено(КПП) Тогда
					ТекстОшибки = Наименование + ". Не найден с КПП: " + КПП + ", но с ИНН: " + ИНН + " более 1";
				Иначе	
					ТекстОшибки = Наименование + ". Найдено более 1 контрагента с ИНН: " + ИНН;
				КонецЕсли;	
				
				Возврат Справочники.Контрагенты.ПустаяСсылка();
			Иначе
				
				СтрокаТЗ = Таблица[0]; 
				Если ЗначениеЗаполнено(КПП) Тогда
					ТекстОшибки = Наименование + ". Не совпадает КПП: " + КПП + ". В базе: " + СтрокаТЗ.КПП;
				КонецЕсли;	
				
				Возврат СтрокаТЗ.Ссылка;
				
			КонецЕсли;	
		
		КонецЕсли;
		
	Иначе
		
		// По наименованию ищем любой
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Спр.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Спр
		|ГДЕ
		|	НЕ Спр.ЭтоГруппа
		|	И НЕ Спр.ПометкаУдаления
		|	И Спр.Наименование = &Наименование";
		
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Возврат Результат.Выгрузить()[0][0];
		КонецЕсли;
		
	КонецЕсли;	
	
КонецФункции
