
// Преобразование строки в дату
//
// Параметры:
//	Парам - Строка вида 01.02.2018
//
// Возвращаемое значение: Дата
//
Функция вДату(Парам) Экспорт
	
	Попытка
		Возврат Дата(Парам + " 00:00:00");
	Исключение
		Возврат '0001-01-01';
	КонецПопытки;	
	
КонецФункции	

// Выполняет запрос к базе данных
//
// Параметры:
//	Соединение   - COM объект ADO.Connection
//	ТекстЗапроса - Строка
//
// Возвращаемое значение: ТаблицаЗначений
//
Функция ВыполнитьЗапросADO(Соединение, ТекстЗапроса) Экспорт
	
	НаборЗаписей = Соединение.Execute(ТекстЗапроса);
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	Для Счетчик = 0 По НаборЗаписей.Fields.Count - 1 Цикл
		ТаблицаДанных.Колонки.Добавить(НаборЗаписей.Fields(Счетчик).Name);
	КонецЦикла;	
	
	Если НЕ НаборЗаписей.EOF Тогда		

		НаборЗаписей.MoveFirst();
		Пока НЕ НаборЗаписей.EOF Цикл
			
			НоваяЗапись = ТаблицаДанных.Добавить();
			Для каждого Колонка из ТаблицаДанных.Колонки Цикл
				НоваяЗапись[Колонка.Имя] = НаборЗаписей.Fields(Колонка.Имя).Value;
			КонецЦикла;	

			НаборЗаписей.MoveNext();
			
		КонецЦикла;
		
	КонецЕсли;
	
	НаборЗаписей.Close();
	
	Возврат ТаблицаДанных;
	
КонецФункции

// Вычисляет значение З1*К1 + З2*К2 + ... + Зn*Кn в разрезе аналитик
// Аналитики показателей должны быть одинаковы
// Аналог функции СУММАПРОИЗВ() из Excel
//
// Параметры:
//	ДокументОбъект - ДокументОбъект.НастраиваемыйОтчет
//	КодПоказателяЗначение - Строка
//	КодПоказателяКоличество - Строка
//	ИтогоКоличество - Число, куда возвращается сумма по показателю КодПоказателяКоличество
//
// Возвращаемое значение: Число
//
Функция СуммаПроизведение(ДокументОбъект, КодПоказателяЗначение, КодПоказателяКоличество, ИтогоКоличество = 0) Экспорт
	
	ТаблицаЗначение = ДокументОбъект.ТаблицаТекущихЗначенийПоказателей(КодПоказателяЗначение);
	ТаблицаКоличество = ДокументОбъект.ТаблицаТекущихЗначенийПоказателей(КодПоказателяКоличество);
	
	СтруктураОтбора = Новый Структура("Аналитика1, Аналитика2, Аналитика3");
	
	ИтогоСумма      = 0;
	ИтогоКоличество = 0;
	Для каждого СтрокаЗначение из ТаблицаЗначение Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаЗначение);

		НайденныеСтроки = ТаблицаКоличество.НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;	
		
		СтрокаКоличество = НайденныеСтроки[0];
 		ИтогоСумма      = ИтогоСумма      + СтрокаЗначение.Значение * СтрокаКоличество.Значение;
		ИтогоКоличество = ИтогоКоличество + СтрокаКоличество.Значение;
		
	КонецЦикла;

	Возврат ИтогоСумма;
	
КонецФункции

// Вычисляет значение (З1*К1 + З2*К2 + ... + Зn*Кn)/(К1 + ... + Кn) в разрезе аналитик
// Аналитики показателей должны быть одинаковы
//
// Параметры:
//	ДокументОбъект - ДокументОбъект.НастраиваемыйОтчет
//	КодПоказателяЗначение - Строка
//	КодПоказателяКоличество - Строка
//
// Возвращаемое значение: Число
//
Функция Средневзвешанное(ДокументОбъект, КодПоказателяЗначение, КодПоказателяКоличество) Экспорт
	
	ИтогоКоличество = 0;
	ИтогоСумма = СуммаПроизведение(ДокументОбъект, КодПоказателяЗначение, КодПоказателяКоличество, ИтогоКоличество);
	
	ТаблицаЗначение = ДокументОбъект.ТаблицаТекущихЗначенийПоказателей(КодПоказателяЗначение);
	ТаблицаКоличество = ДокументОбъект.ТаблицаТекущихЗначенийПоказателей(КодПоказателяКоличество);
	
	Если ИтогоКоличество = 0 Тогда
		Возврат 0;
	Иначе	
		Возврат ИтогоСумма / ИтогоКоличество;
	КонецЕсли;	
	
КонецФункции	
