
Функция СуммаПроизведение(ДокументОбъект, КодПоказателяЗначение, КодПоказателяКоличество, ИтогоКоличество = 0) Экспорт
	
	ТаблицаЗначение = ДокументОбъект.ТаблицаТекущихЗначенийПоказателей(КодПоказателяЗначение);
	ТаблицаКоличество = ДокументОбъект.ТаблицаТекущихЗначенийПоказателей(КодПоказателяКоличество);
	
	СтруктураОтбора = Новый Структура("Аналитика1, Аналитика2, Аналитика3");
	
	ИтогоСумма      = 0;
	ИтогоКоличество = 0;
	Для каждого СтрокаЗначение из ТаблицаЗначение Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаЗначение);

		НайденныеСтроки = ТаблицаКоличество.НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;	
		
		СтрокаКоличество = НайденныеСтроки[0];
 		ИтогоСумма      = ИтогоСумма      + СтрокаЗначение.Значение * СтрокаКоличество.Значение;
		ИтогоКоличество = ИтогоКоличество + СтрокаКоличество.Значение;
		
	КонецЦикла;

	Возврат ИтогоСумма;
	
КонецФункции

Функция Средневзвешанное(ДокументОбъект, КодПоказателяЗначение, КодПоказателяКоличество) Экспорт
	
	ИтогоКоличество = 0;
	ИтогоСумма = СуммаПроизведение(ДокументОбъект, КодПоказателяЗначение, КодПоказателяКоличество, ИтогоКоличество);
	
	ТаблицаЗначение = ДокументОбъект.ТаблицаТекущихЗначенийПоказателей(КодПоказателяЗначение);
	ТаблицаКоличество = ДокументОбъект.ТаблицаТекущихЗначенийПоказателей(КодПоказателяКоличество);
	
	Если ИтогоКоличество = 0 Тогда
		Возврат 0;
	Иначе	
		Возврат ИтогоСумма / ИтогоКоличество;
	КонецЕсли;	
	
КонецФункции	
