#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВремяДокументаПоУмолчанию() Экспорт
	
	Возврат Новый Структура("Часы, Минуты", 14, 0);
	
КонецФункции

#КонецОбласти

Функция ПолучитьДокументБУ(ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Основание", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтчетКомитентуОПродажах КАК Док
	|ГДЕ
	|	Док.АСЦ_Основание = &Основание
	|	И НЕ Док.ПометкаУдаления";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат.Выгрузить()[0][0];
	КонецЕсли;
	
КонецФункции	

#КонецЕсли
