
&НаСервере
Процедура АСЦ1_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	
	Перем ОбъектОснование;
	
	Параметры.Свойство("РедактированиеНастроек", РедактированиеНастроек);
	Параметры.Свойство("ЭтоРасшифровка", ЭтоРасшифровка);
	Параметры.Свойство("ЗначениеКопирования", ОбъектОснование);
	Параметры.Свойство("АдресХранилищаНастроек", АдресХранилищаНастроек);
	URLСхемы = ТиповыеОтчетыУХ.СформироватьСхемуКомпоновкиДанных(Объект, УникальныйИдентификатор);
	
	Попытка
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы));
	Исключение
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "При инициализации отчета возникла ошибка:
									  |" + ОписаниеОшибки();
		СообщениеПользователю.Сообщить();
		
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
		
	КонецПопытки;
	
	ЭтоМониторКлючевыхПоказателей = (Объект.ВидПроизвольногоОтчета = 1);
	Элементы.ДополнительныеНастройки.Доступность = НЕ ЭтоМониторКлючевыхПоказателей; // У МКП не может быть дополнительных отборов и параметров.
	Элементы.Период.Видимость = ЭтоМониторКлючевыхПоказателей;
	
	ОтборТрендНулевой                = Истина;
	ОтборТрендОтрицательный          = Истина;
	ОтборТрендПоложительный          = Истина;
	ОтборСостояниеТревожное          = Истина;
	ОтборСостояниеУдовлетворительное = Истина;
	ОтборСостояниеХорошее            = Истина;
	
	// Если редактируются настройки документа, то 
	Если НЕ РедактированиеНастроек Тогда
		ЗаполнитьСписокДоступныхНастроек();
	Иначе
		Элементы.СохраненнаяНастройка.Видимость = Ложь;
	КонецЕсли;
	
	ТекОБъект = РеквизитФормыВЗначение("Объект");
	
	ПараметрыПанелиПользователя = ТиповыеОтчетыУХ.ПолучитьПараметрыПанелиПользователяОбъекта(ТекОбъект);
	АдресПараметровПанелиФормы = ПоместитьВоВременноеХранилище(ПараметрыПанелиПользователя, УникальныйИдентификатор);
	
	ЗначениеВРеквизитФормы(ТекОбъект, "Объект");
	
	ФормироватьПриОткрытии = Параметры.ФормироватьПриОткрытии;
	
	Если ЭтоРасшифровка Тогда
		СкрытьЭлементыФормыПриРасшифровке();
	Иначе
		ОбработкаВидимостиПанелейОтчета(ПараметрыПанелиПользователя);
	КонецЕсли;
	
	ВосстановитьНастройки();
	ЗагрузитьДанныеПоУмолчаниюВКомпоновщикДанных();
	
	Если Параметры.Настройки <> Неопределено Тогда // Настройки получены извне. Данные из сохраненной настройки не подтягиваются.
		
		//АСЦ Ситников++
		//Справочники.ПроизвольныеОтчеты.СкопироватьНастройкиКомпоновщика(КомпоновщикНастроек.Настройки, Параметры.Настройки);
		КомпоновщикНастроек.ЗагрузитьНастройки(Параметры.Настройки);
		Если Параметры.Свойство("ПользовательскиеНастройкиКомпоновщика") Тогда
			КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(Параметры.ПользовательскиеНастройкиКомпоновщика);
		КонецЕсли;	
		//АСЦ Ситников--
		
	Иначе
		
		СохраненнаяНастройка = Справочники.СохраненныеНастройки.ПустаяСсылка();
		
		Если Параметры.ИспользоватьПереданнуюНастройку Тогда
			СохраненнаяНастройка = Параметры.СохраненнаяНастройка;
		ИначеЕсли НЕ Параметры.Ключ.Пустая() Тогда
			СохраненнаяНастройка = Справочники.ПроизвольныеОтчеты.ОпределитьТекущуюНастройкуОтчета(Объект.Ссылка, ОбщегоНазначенияУХ.ПолучитьЗначениеПеременной("глТекущийПользователь"));
		КонецЕсли;
		
		ПрименитьСохраненныеНастройки();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.АдресДанныхРасшифровки) Тогда
		Вн_ДанныеРасшифровки = ПолучитьИзВременногоХранилища(Параметры.АдресДанныхРасшифровки);
		МассивПолейРасшифровки = ТиповыеОтчетыУХ.ПолучитьМассивПолейРасшифровки(Параметры.Расшифровка, Вн_ДанныеРасшифровки, КомпоновщикНастроек);
		Настроить(МассивПолейРасшифровки);
	КонецЕсли;
	// Расшифруем монитор ключевых показателей аналитическим отчетом.
	Если ЗначениеЗаполнено(Параметры.АдресМассивРасшифровок) Тогда
		Если ЭтоАдресВременногоХранилища(Параметры.АдресМассивРасшифровок) Тогда
			МассивРасшифровок = ПолучитьИзВременногоХранилища(Параметры.АдресМассивРасшифровок);
			МассивПолейРасшифровки = Новый Массив;
			Для Каждого ТекМассивРасшифровок Из МассивРасшифровок Цикл
				МассивПолейРасшифровки.Добавить(ТекМассивРасшифровок);
			КонецЦикла;
			Настроить(МассивПолейРасшифровки, Истина);
		Иначе
			
		КонецЕсли;
	Иначе
		// Не задан адрес расшифровки монитора ключевых показателей.
	КонецЕсли;
	
	Если Параметры.ЗначенияПараметров.Количество() <> 0 Тогда
		Для Каждого Элемент Из Параметры.ЗначенияПараметров Цикл
			
			Попытка
				КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Элемент.Представление, Элемент.Значение);
			Исключение
			КонецПопытки;
			
		КонецЦикла;
	КонецЕсли; 
	
	Если ФормироватьПриОткрытии Тогда
		ОбновитьОтчет(Истина);
	КонецЕсли;
	
	ЗначениеВДанныеФормы(ОбщегоНазначенияСерверУХ.ВернутьТаблицуДоступныхПериодов(), ТаблицаДоступныхПериодов);
	ИзменитьВидимостьОтборов();
	
КонецПроцедуры

&НаСервере
&Вместо("ПрименитьСохраненныеНастройки")
Процедура АСЦ1_ПрименитьСохраненныеНастройки(Знач ТекущаяНастройка)
	
	ОтчетОбъект = РеквизитФормыВЗначение("Объект");
	
	Если ТекущаяНастройка = Неопределено Тогда
		ТекущаяНастройка = ?(СохраненнаяНастройка.Пустая(), Неопределено, СохраненнаяНастройка);
	КонецЕсли;
	
	Если ТипЗнч(ТекущаяНастройка) = Тип("СправочникСсылка.СохраненныеНастройки") Тогда
		НастройкиОтчета = ТекущаяНастройка.ХранилищеНастроек.Получить();
		Если ТипЗнч(НастройкиОтчета) = Тип("Структура") И НастройкиОтчета.Свойство("ЗначенияНастроекПанелиОтчета") Тогда
			ЗначенияНастроекПанелиОтчета = НастройкиОтчета.ЗначенияНастроекПанелиОтчета;
		Иначе
			ЗначенияНастроекПанелиОтчета = ОтчетОбъект.ЗначенияНастроекПанелиПользователя.Получить();
		КонецЕсли;
	
	ИначеЕсли ТекущаяНастройка = Неопределено Тогда
		ЗначенияНастроекПанелиОтчета = ОтчетОбъект.ЗначенияНастроекПанелиПользователя.Получить();
	Иначе
		СтруктураНастроек = ТекущаяНастройка.Получить();
		Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
			ЗначенияНастроекПанелиОтчета = СтруктураНастроек.ЗначенияНастроекПанелиОтчета;
		Иначе
			ЗначенияНастроекПанелиОтчета = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ЗначенияНастроекПанелиОтчета) = тип("Структура") Тогда
		
		ТиповыеОтчеты_УправляемыйРежимУХ.ВосстановитьЗначенияНастроекПанелиПользователя(ЗначенияНастроекПанелиОтчета, ЭтаФорма);
		ЗагрузитьДанныеПоУмолчаниюВКомпоновщикДанных();
		Если ТекущаяНастройка <> Неопределено Тогда
			//АСЦ Ситников++
			//Справочники.ПроизвольныеОтчеты.СкопироватьНастройкиКомпоновщика(КомпоновщикНастроек.Настройки, ЗначенияНастроекПанелиОтчета.НастройкиКомпоновщика);
			КомпоновщикНастроек.ЗагрузитьНастройки(ЗначенияНастроекПанелиОтчета.НастройкиКомпоновщика);
			Если ЗначенияНастроекПанелиОтчета.Свойство("ПользовательскиеНастройкиКомпоновщика") Тогда
				КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(ЗначенияНастроекПанелиОтчета.ПользовательскиеНастройкиКомпоновщика);
			КонецЕсли;	
			//АСЦ Ситников--
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура АСЦ1_СохраненнаяНастройкаНачалоВыбораВместо(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
