#Область ОписаниеОбработки

Функция СведенияОВнешнейОбработке() Экспорт

	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.1.3.1");
	
	// Запуск через фоновое не работает в режиме разрешений
	// Каталог не обнаружен 'e1cib\tempstorage\dee284a6-d234-4482-b97c-3ab694a1d1dd'
	//ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.1");
	//
	//// HKEY_LOCAL_MACHINE\SOFTWARE\Classes\ADODB.Connection
	//Разрешение = РаботаВБезопасномРежиме.РазрешениеНаСозданиеCOMКласса("ADODB.Connection", "{00000514-0000-0010-8000-00AA006D2EA4}");
	//ПараметрыРегистрации.Разрешения.Добавить(Разрешение);
	
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия = Метаданные().Комментарий;
	ПараметрыРегистрации.БезопасныйРежим = Истина;
	ПараметрыРегистрации.Информация = "Загрузка документов Реализация из UNICUS";
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = Метаданные().Представление() + " - Открыть форму";
	НоваяКоманда.Идентификатор = Метаданные().Имя + "Форма";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	НоваяКоманда.ПоказыватьОповещение = Ложь;
	
	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление = "Загрузить реализации";
	НоваяКоманда.Идентификатор = "ЗагрузитьРеализации";
	НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	НоваяКоманда.ПоказыватьОповещение = Ложь;

	Возврат ПараметрыРегистрации;

КонецФункции

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыКоманды = Неопределено) Экспорт 
	
	Параметры = Новый Структура;
	
	База = ХранилищеОбщихНастроек.Загрузить("ЗагрузкаДокументовИзUnicus", "База",, "ЗагрузкаДокументовИзUnicus");
	Если НЕ ЗначениеЗаполнено(База) Тогда
		База = Справочники.ВнешниеИнформационныеБазы.НайтиПоНаименованию("Юникус");
	КонецЕсли;
	
	Параметры.Вставить("База",        База);
	Параметры.Вставить("ДатаНач",     ХранилищеОбщихНастроек.Загрузить("ЗагрузкаДокументовИзUnicus", "ДатаПоследнегоДокумента",, "ЗагрузкаДокументовИзUnicus"));
	Параметры.Вставить("ДатаКон",     '2100-01-01');
	Параметры.Вставить("Организация", Неопределено);
	Параметры.Вставить("ПерезаполнятьДокументы",   Ложь);
	Параметры.Вставить("ПерезаполнятьДоговоры",    Ложь);
	Параметры.Вставить("ВыводитьСообщения",        Ложь);
	Параметры.Вставить("ЗагружатьДокументыОплаты", Истина);
	
	ЗагрузитьРеализации(Параметры);
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеФункции

Функция ЕстьNULL(Парам, Значение)
	Возврат ?(ЗначениеЗаполнено(Парам), Парам, Значение);
КонецФункции	

Функция вДату(Парам)
	
	Массив = СтрРазделить(Парам, ".");
	Возврат Дата(Число(Массив[2]), Число(Массив[1]), Число(Массив[0]));
	
КонецФункции	

Функция ЗаписатьДокумент(ДокОбъект, Режим, Сообщать = Истина)
	
	Результат = Истина;	
	
	Если ДокОбъект = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;	
	
	// тк некуда записывать пропущенные документы, то будем просто останавливать обработку
	ДокОбъект.Записать(Режим);
	
	//Попытка
	//	ДокОбъект.Записать(Режим);
	//Исключение
	//	
	//	ОписаниеОшибки = ОписаниеОшибки();
	//	Сообщить(ОписаниеОшибки);
	//	ЗаписьЖурналаРегистрации("Загрузка документов UNICUS",
	//		УровеньЖурналаРегистрации.Ошибка, ДокОбъект.Метаданные(), ДокОбъект.Ссылка, ОписаниеОшибки);
	//		
	//	Результат = Ложь;	
	//	
	//КонецПопытки;	
	
	Если Сообщать Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Строка(ДокОбъект);
		Сообщение.КлючДанных = ДокОбъект.Ссылка;
		Сообщение.Сообщить();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

Функция ЗначенияОтличаются(Структруа1, Структура2)
	
	Для каждого КлючИЗначение Из Структруа1 Цикл
		
		Если КлючИЗначение.Значение <> Структура2[КлючИЗначение.Ключ] Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат Ложь;
	
КонецФункции	

Процедура ДобавитьИзменениеОбъекта(ДокументСсылка, База)
	
	Если НЕ ЗначениеЗаполнено(База) Тогда
		Возврат;
	КонецЕсли;	
	
	НаборЗаписей = РегистрыСведений.ИзмененныеОбъектыДляВыгрузки.СоздатьНаборЗаписей();
	Запись = НаборЗаписей.Добавить();
	Запись.ИспользуемаяИБ        = База;
	Запись.НастройкаСоответствия = "";
	Запись.Элемент               = ДокументСсылка;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры	

Функция ПолучитьДатуЗапретаИзменения(Организация, Кэш)
	
	ДатаЗапрета = Кэш[Организация];
	Если ДатаЗапрета <> Неопределено Тогда
		Возврат ДатаЗапрета;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Организация", Организация);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК Порядок,
	|	ДатыЗапретаИзменения.ДатаЗапрета КАК ДатаЗапрета
	|ИЗ
	|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
	|ГДЕ
	|	ДатыЗапретаИзменения.Объект = &Организация
	|	И ДатыЗапретаИзменения.Пользователь = ЗНАЧЕНИЕ(Перечисление.ВидыНазначенияДатЗапрета.ДляВсехПользователей)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	ДатыЗапретаИзменения.ДатаЗапрета
	|ИЗ
	|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
	|ГДЕ
	|	ДатыЗапретаИзменения.Объект = ЗНАЧЕНИЕ(ПланВидовХарактеристик.РазделыДатЗапретаИзменения.ПустаяСсылка)
	|	И ДатыЗапретаИзменения.Пользователь = ЗНАЧЕНИЕ(Перечисление.ВидыНазначенияДатЗапрета.ДляВсехПользователей)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ДатаЗапрета = '0001-01-01';
	Иначе
		ДатаЗапрета = Результат.Выгрузить()[0].ДатаЗапрета;
	КонецЕсли;	
	
	Кэш.Вставить(Организация, ДатаЗапрета);
	Возврат ДатаЗапрета;
	
КонецФункции

Процедура СохранитьДатуПоследнегоДокумента(ДатаИзменения)
	
	ХранилищеОбщихНастроек.Сохранить("ЗагрузкаДокументовИзUnicus", "ДатаПоследнегоДокумента", ДатаИзменения,, "ЗагрузкаДокументовИзUnicus");
	
КонецПроцедуры	

Функция ДействиеПоДатеЗапрета(Дата, ДатаИзменения, Организация, Кэш)
	
	Результат = Новый Структура;
	Результат.Вставить("ДатаЗапрета", ПолучитьДатуЗапретаИзменения(Организация, Кэш));
	
	Если Дата > Результат.ДатаЗапрета Тогда
		//_____[ДЗ]____Д___ДИ___
		Результат.Вставить("Имя", "Редактирование");
	Иначе	
	
		Если ДатаИзменения > Результат.ДатаЗапрета Тогда
			//_____Д____[ДЗ]___ДИ___
			Результат.Вставить("Имя", "Корректировка");
		Иначе
			//_____Д____ДИ___[ДЗ]___
			Результат.Вставить("Имя", "ИзменениеЗакрытогоПериода");
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции	

#КонецОбласти

#Область ПоискДанных

Функция ПолучитьВидОплаты(Данные, Параметры, СтруктураСсылок)
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Организация", СтруктураСсылок.Организация);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Спр.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыОплатОрганизаций КАК Спр
	|ГДЕ
	|	НЕ Спр.ПометкаУдаления
	|	И Спр.Организация = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка УБЫВ";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Возврат Результат.Выгрузить()[0][0];
	КонецЕсли;
	
	СпрОбъект = Справочники.ВидыОплатОрганизаций.СоздатьЭлемент();
	СпрОбъект.Наименование = "Эквайринг";
	СпрОбъект.Организация  = СтруктураСсылок.Организация;
	СпрОбъект.СчетУчетаРасчетов = ПланыСчетов.Хозрасчетный.ПродажиПоПлатежнымКартам;          //57.03
	СпрОбъект.Контрагент   = АСЦ_ОбщийМодуль.НайтиКонтрагента("", "7734202860", "770801001"); //МКБ
	СпрОбъект.Записать();
	
	Возврат СпрОбъект.Ссылка;
	
КонецФункции

Функция НайтиДокументСторно(ДокументРТУ)
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("ДокументРеализации", ДокументРТУ);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Док.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОперацияБух КАК Док
	|ГДЕ
	|	Док.СторнируемыйДокумент = &ДокументРеализации
	|	И НЕ Док.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Док.Дата УБЫВ";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		ДокументСсылка = Результат.Выгрузить()[0][0];
	Иначе
		ДокументСсылка = Неопределено;
	КонецЕсли;
	
	Возврат ДокументСсылка;
	
КонецФункции	

#КонецОбласти

#Область РеализацииОбщие

Функция ПолучитьДанныеДокументаРТУ(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Организация КАК Организация,
	|	Док.ДоговорКонтрагента КАК Договор,
	|	Док.ДоговорКонтрагента.ОсновнойЦФО КАК ЦФО,
	|	Док.СуммаДокумента КАК Сумма,
	|	ДокАгентскиеУслуги.Номенклатура КАК НоменклатураАгентскиеУслуги,
	|	ДокАгентскиеУслуги.Контрагент КАК Страховая,
	|	ЕСТЬNULL(ДокАгентскиеУслуги.Сумма, 0) КАК СуммаАгенскиеУслуги,
	|	ДокУслуги.Номенклатура КАК НоменклатураУслуги,
	|	ЕСТЬNULL(ДокУслуги.Сумма, 0) КАК СуммаУслуги
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК ДокУслуги
	|		ПО (ДокУслуги.Ссылка = Док.Ссылка)
	|			И (ДокУслуги.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.АгентскиеУслуги КАК ДокАгентскиеУслуги
	|		ПО (ДокАгентскиеУслуги.Ссылка = Док.Ссылка)
	|			И (ДокАгентскиеУслуги.НомерСтроки = 1)
	|ГДЕ
	|	Док.Ссылка = &Ссылка";
	
	Возврат Запрос.Выполнить().Выгрузить()[0];
	
КонецФункции	

Функция ПолучитьДанныеДокументаКорректировка(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Организация КАК Организация,
	|	Док.ДоговорКонтрагента КАК Договор,
	|	Док.ДоговорКонтрагента.ОсновнойЦФО КАК ЦФО,
	|	Док.СуммаДокумента КАК Сумма,
	|	ДокАгентскиеУслуги.Номенклатура КАК НоменклатураАгенскиеУслуги,
	|	ДокАгентскиеУслуги.Контрагент КАК Страховая,
	|	ЕСТЬNULL(ДокАгентскиеУслуги.Сумма, 0) КАК СуммаАгенскиеУслуги,
	|	ДокУслуги.Номенклатура КАК НоменклатураУслуги,
	|	ЕСТЬNULL(ДокУслуги.Сумма, 0) КАК СуммаУслуги
	|ИЗ
	|	Документ.КорректировкаРеализации КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Услуги КАК ДокУслуги
	|		ПО (ДокУслуги.Ссылка = Док.Ссылка)
	|			И (ДокУслуги.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.АгентскиеУслуги КАК ДокАгентскиеУслуги
	|		ПО (ДокАгентскиеУслуги.Ссылка = Док.Ссылка)
	|			И (ДокАгентскиеУслуги.НомерСтроки = 1)
	|ГДЕ
	|	Док.Ссылка = &Ссылка";
	
	Возврат Запрос.Выполнить().Выгрузить()[0];
	
КонецФункции

Функция ИзменилисьСуммы(ДанныеДокумента, Данные, ДанныеСуммы, СтруктураСсылок)
	
	// Корректировку можно делать только по суммам
	Если Данные.СуммаОплаты <> ДанныеДокумента.Сумма Тогда
		Возврат Истина;
	КонецЕсли;	
	
	Если ДанныеСуммы.СуммаВыручка <> ДанныеДокумента.СуммаУслуги Тогда
		Возврат Истина;
	КонецЕсли;	
	
	Возврат Ложь;
	
КонецФункции	

Функция ИзменилисьРеквизиты(ДанныеДокумента, Данные, ДанныеСуммы, СтруктураСсылок)
	
	Если СтруктураСсылок.Договор <> ДанныеДокумента.Договор Тогда
		Возврат Истина;
	КонецЕсли;	
	
	Если СтруктураСсылок.Организация <> ДанныеДокумента.Организация Тогда
		Возврат Истина;
	КонецЕсли;	
	
	Возврат Ложь;
	
КонецФункции

Функция ИзменилисьПрочиеРеквизиты(ДанныеДокумента, Данные, ДанныеСуммы, СтруктураСсылок)
	
	Если ЗначениеЗаполнено(ДанныеДокумента.НоменклатураУслуги)
		И СтруктураСсылок.Номенклатура <> ДанныеДокумента.НоменклатураУслуги Тогда
		Возврат Истина;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ДанныеДокумента.НоменклатураАгентскиеУслуги)
		И СтруктураСсылок.Номенклатура <> ДанныеДокумента.НоменклатураАгентскиеУслуги Тогда
		Возврат Истина;
	КонецЕсли;	
	
	Возврат Ложь;
	
КонецФункции

Функция ИзменитьЦФО(ДокументСсылка, СтруктураСсылок)
	
	НачатьТранзакцию();
	
	ДоговорОбъект = СтруктураСсылок.Договор.ПолучитьОбъект();
	ДоговорОбъект.ОсновнойЦФО = СтруктураСсылок.ЦФО;
	ДоговорОбъект.Записать();
	
	ДобавитьИзменениеОбъекта(ДокументСсылка, СтруктураСсылок.БазаАстра);
	
	ЗафиксироватьТранзакцию();
	
КонецФункции	

#КонецОбласти

#Область Реализации

Функция ПолучитьТаблицуДанныхРеализации(База, ДатаНач, ДатаКон, Организация = Неопределено, Тест_КоличествоСтрок = Неопределено, Тест_Договор = Неопределено, Тест_VIN = Неопределено)
	
	ТекстЗапроса =
	"SELECT
	|	tab.FULL_PREMIUM as FULL_PREMIUM,
	|	tab.PREMIUM_SUM as PREMIUM_SUM,
	|	tab.KV as KV,
	|	tab.KV_RUB as KV_RUB,
	|	CASE WHEN tab.INSUR_TYPE = 'пролонгация' 
	|		THEN 1
	|		ELSE 0
	|	END as Пролонгация,
	|	tab.TS_NEW as TS_NEW,
	|	tab.STORONNIY_CLIENT as STORONNIY_CLIENT,
	// Номенклатура
	|	tab.PRODUCT_NAME as Номенклатура,
	// ТС
	|	tab.VIN as VIN,
	|	tab.TRANSPORT_MARK as TRANSPORT_MARK,
	|	tab.TRANSPORT_MODEL as TRANSPORT_MODEL,
	|	TO_NUMBER(tab.TRANSPORT_OUT_DATE) as TRANSPORT_OUT_DATE,
	// Контрагент
	|	tab.EKB_ID_C as КонтрагентГУИД,
	|	tab.SUBJECT_NAME as Контрагент,
	|	tab.INSURER_INN as КонтрагентИНН,
	|	tab.INSURER_KPP as КонтрагентКПП,
	|	tab.INSURER_DOC_SERIES as КонтрагентПаспортСерия,
	|	tab.INSURER_DOC_NUMBER as КонтрагентПаспортНомер,
	|	tab.INSURER_DATE_OUT as КонтрагентПаспортДата,
	|	tab.INSURER_PLACE_OUT as КонтрагентПаспортВыдан,
	// Договор
	|	tab.POLICY_NUMBER as Договор,
	// Даты, время отбрасываем
	|	TRUNC(tab.PAY_DATE) as Дата,
	|	TRUNC(tab.DATE_SIGN) as ДоговорДата,
	|	TRUNC(tab.ACTION_BEGIN_DATE) as ДатаНачала,
	|	TRUNC(tab.ACTION_END_DATE) as СрокДействия,
	// Страховая
	|	tab.SK_NAME as Страховая,
	|	tab.SK_INN as СтраховаяИНН,
	|	tab.SK_KPP as СтраховаяКПП,
	// Подразделение
	|	tab.DEPARTMENT_NAME as ЦФО,
	// Банк
	|	tab.BANK as Банк,
	|	tab.BANK_BIK as БанкБИК,
	// Организация
	|	tab.AGENT as Организация,
	|	tab.AGENT_INN as ОрганизацияИНН,
	|	tab.AGENT_KPP as ОрганизацияКПП,
	// Тип: Сторонний, АМ коммерч, АМ корпор, АМ бу, АМ розница
	|	tab.TSFO as ТипПродажи,
	// Тип платежа: Наличные, Безналичный, Эквайринг, Прямые расчеты с СК
	|	tab.PAY_TYPE as ТипПлатежа,
	|	tab.PAY_AMOUNT as СуммаОплаты,
	|	NVL(tab.DATE_UPDATE, tab.PAY_DATE) as ДатаИзменения,
	|	TO_CHAR(tab.PAY_ID) as ID
	|FROM 
	|	unicusweb_release.v_asc_pay_contract tab
	|WHERE
	|	NVL(tab.DATE_UPDATE, tab.PAY_DATE) BETWEEN &ДатаНач AND &ДатаКон
	// Прямые расчеты с СК будем грузить отдельно
	|	AND tab.PAY_TYPE = 'Прямые расчеты с СК'";
	
	Если ЗначениеЗаполнено(Тест_Договор) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	AND tab.POLICY_NUMBER = '" + СокрЛП(Тест_Договор) + "'";
	КонецЕсли;	
		
	Если ЗначениеЗаполнено(Тест_VIN) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	AND tab.VIN = '" + СокрЛП(Тест_VIN) + "'";
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|	AND tab.AGENT_INN = '" + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ИНН") + "'";
		
		КПП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "КПП");
		Если ЗначениеЗаполнено(КПП) Тогда
			
			ТекстЗапроса = ТекстЗапроса + "
			|	AND tab.AGENT_KPP = '" + КПП + "'";
			
		КонецЕсли;	
		
	КонецЕсли;	
	
	ТекстЗапроса = ТекстЗапроса + "
	|
	|ORDER BY
	|	NVL(tab.DATE_UPDATE, tab.PAY_DATE), СуммаОплаты";
	
	// Отладочные отборы
	//Доп отбор для тестирования
	// например AND rownum <= 10  - выбираем только первые 10 записей
	Если ЗначениеЗаполнено(Тест_КоличествоСтрок) Тогда
		
		ТекстЗапроса =  
		"SELECT
		| *
		|FROM (
		|" + ТекстЗапроса + "
		|)
		|WHERE
		|	rownum <= " + Формат(Тест_КоличествоСтрок, "ЧГ=0");
		
	КонецЕсли;	
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДатаНач", ИнтеграцияСВнешнимиСистемамиУХ.АСЦ1_асцПолучитьТекстПараметра(ДатаНач, "Oracle"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДатаКон", ИнтеграцияСВнешнимиСистемамиУХ.АСЦ1_асцПолучитьТекстПараметра(ДатаКон, "Oracle"));
	
	СтрокаСоединения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(База, "СтрокаПодключения");
	
	Соединение = Новый COMОбъект("ADODB.Connection");
	Соединение.Open(СтрокаСоединения);
	
	Возврат АСЦ_ОбщийМодуль.ВыполнитьЗапросADO(Соединение, ТекстЗапроса);
	
Конецфункции	

Функция ПолучитьТаблицуДанныхРеализацииТест()
	
	// Для тестирования разных ситуаций подготовим таблицу вручную
	Макет = ПолучитьМакет("ТестовыеДанные");
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	Для Счетчик = 2 По Макет.ШиринаТаблицы Цикл
		
		Тип = Макет.Область(1, Счетчик).Текст;
		Имя = Макет.Область(2, Счетчик).Текст;
		Если Тип = "Дата" Тогда
			Тип = Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
		ИначеЕсли Тип = "Число" Тогда	
			Тип = Новый ОписаниеТипов("Число");
		Иначе
			Тип = Неопределено;
		КонецЕсли;
		
		ТаблицаЗначений.Колонки.Добавить(Имя, Тип);
		
	КонецЦикла;	
	
	Для СчетчикСтрок = 3 По Макет.ВысотаТаблицы Цикл
		
		// В первой колонке пометка
		Пометка = Макет.Область(СчетчикСтрок, 1).Текст;
		Если НЕ ЗначениеЗаполнено(Пометка) Тогда
			Продолжить;
		КонецЕсли;	
		
		НоваяСтрока = ТаблицаЗначений.Добавить();
		
		Для каждого Колонка из ТаблицаЗначений.Колонки Цикл
			
			СчетчикКолонок = ТаблицаЗначений.Колонки.Индекс(Колонка) + 2;
			Значение = Макет.Область(СчетчикСтрок, СчетчикКолонок).Текст;
			
			Если ТипЗнч(НоваяСтрока[Колонка.Имя]) = Тип("Дата") Тогда
				НоваяСтрока[Колонка.Имя] = Дата(Значение);
			ИначеЕсли ТипЗнч(НоваяСтрока[Колонка.Имя]) = Тип("Число") Тогда
				НоваяСтрока[Колонка.Имя] = Число(Значение);
			Иначе
				НоваяСтрока[Колонка.Имя] = Значение;
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЦикла;	
	
	Возврат ТаблицаЗначений;
	
Конецфункции	

Процедура ЗагрузитьРеализации(Параметры, АдресРезультата = Неопределено) Экспорт
	
	База        = Параметры.База;
	ДатаНач     = Параметры.ДатаНач;
	Если НЕ ЗначениеЗаполнено(ДатаНач) Тогда
		ДатаНач = '2018-01-01';
	КонецЕсли;	
	ДатаКон     = Параметры.ДатаКон;
	Организация = Параметры.Организация;
	ПерезаполнятьДокументы = Параметры.ПерезаполнятьДокументы;
	ПерезаполнятьДоговоры  = Параметры.ПерезаполнятьДоговоры;
	ВыводитьСообщения      = Параметры.ВыводитьСообщения;
	ЗагружатьДокументыОплаты = Параметры.ЗагружатьДокументыОплаты;
	
	Тест_КоличествоСтрок = 0;
	Параметры.Свойство("Тест_КоличествоСтрок", Тест_КоличествоСтрок);
	
	Тест_Договор = "";
	Параметры.Свойство("Тест_Договор", Тест_Договор);
	
	Тест_VIN = "";
	Параметры.Свойство("Тест_VIN", Тест_VIN);
	
	ТипБазы   = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(База, "ТипБД"); 
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("КонтрагентРодительФЛ",   Справочники.Контрагенты.НайтиПоНаименованию("1 Физические лица"));
	ДопПараметры.Вставить("КонтрагентРодительЮЛ",   Справочники.Контрагенты.НайтиПоНаименованию("1 Юридические лица"));
	ДопПараметры.Вставить("НастройкаДепартаменты",  Справочники.СоответствиеВнешнимИБ.НайтиПоНаименованию("DEPARTMENTS <-> Организации",,, ТипБазы));
	ДопПараметры.Вставить("НастройкаСтатьиДоходов", Справочники.СоответствиеВнешнимИБ.НайтиПоНаименованию("Номенклатура <-> Статьи доходов",,, ТипБазы));
	ДопПараметры.Вставить("ПерезаполнятьДокументы", ПерезаполнятьДокументы);
	ДопПараметры.Вставить("ПерезаполнятьДоговоры",  ПерезаполнятьДоговоры);
	ДопПараметры.Вставить("ВыводитьСообщения",      ВыводитьСообщения);
	
	ДопПараметры.Вставить("СвойствоID", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ID_Unicus"));
	ДопПараметры.Вставить("СвойствоДЦ", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ДЦ"));
	
	ДоговорДопРеквизиты = Новый Структура;
	ДоговорДопРеквизиты.Вставить("Страховая", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "Страховая"));
	ДоговорДопРеквизиты.Вставить("Банк",      ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "Банк"));
	
	ДопПараметры.Вставить("ДоговорДопРеквизиты", ДоговорДопРеквизиты);
	
	ТаблицаДанных = ПолучитьТаблицуДанныхРеализации(База, ДатаНач, ДатаКон, Организация, Тест_КоличествоСтрок, Тест_Договор, Тест_VIN);
	// Заранее подготовленные данные, для отладки создания документов
	//ТаблицаДанных = ПолучитьТаблицуДанныхРеализацииТест();
	
	КэшДанных = Новый Структура;
	КэшДанных.Вставить("Организация",  Новый Соответствие);
	КэшДанных.Вставить("Департамент",  Новый Соответствие);
	КэшДанных.Вставить("Страховая",    Новый Соответствие);
	КэшДанных.Вставить("Номенклатура", Новый Соответствие);
	КэшДанных.Вставить("СведенияОНоменклатуре", Новый Соответствие);
	КэшДанных.Вставить("СтатьиДоходов", Новый Соответствие);
	КэшДанных.Вставить("ДатыЗапрета",   Новый Соответствие);
	КэшДанных.Вставить("БазаАстра",     Новый Соответствие);
	
	КэшСообщений = Новый Структура;
	КэшСообщений.Вставить("Организация",   Новый Соответствие);
	КэшСообщений.Вставить("Страховая",     Новый Соответствие);
	КэшСообщений.Вставить("Департамент",   Новый Соответствие);
	КэшСообщений.Вставить("Номенклатура",  Новый Соответствие);
	КэшСообщений.Вставить("СтатьяДоходов", Новый Соответствие);
	
	Всего   = ТаблицаДанных.Количество();
	Счетчик = 0;
	
	Для каждого СтрокаТЗ из ТаблицаДанных Цикл
		
		СтруктураСсылок = АСЦ_UNICUS_Contracts.ПолучитьСтруктуруСсылок(СтрокаТЗ, ДопПараметры, База, КэшДанных, КэшСообщений);
		Если НЕ ЗначениеЗаполнено(СтруктураСсылок.Организация) Тогда
			Продолжить;
		КонецЕсли;	
		
		ДокРТУ = СоздатьДокументРТУ_Корректировка_Сторно(СтрокаТЗ, ДопПараметры, СтруктураСсылок, КэшДанных);
		
		//Если ЗагружатьДокументыОплаты = Истина Тогда
		//	СоздатьДокументОплаты(СтрокаТЗ, ДопПараметры, СтруктураСсылок, ДокРТУ);
		//КонецЕсли;	
		
		Счетчик = Счетчик + 1;
		ПроцентВыполнения = Окр(100 * Счетчик / Всего, 2);
		ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения, "Загружено " + Счетчик + " из " + Всего);
			
	КонецЦикла;	
	
КонецПроцедуры	

Функция СоздатьДокументРТУ_Корректировка_Сторно(Данные, Параметры, СтруктураСсылок, КэшДанных)
	
	ДокументСсылка = АСЦ_ПоискОбъектов.НайтиДокументПоСвойству(Данные.ID, Параметры.СвойствоID, "РеализацияТоваровУслуг");
	
	Действие = ДействиеПоДатеЗапрета(Данные.Дата, Данные.ДатаИзменения, СтруктураСсылок.Организация, КэшДанных.ДатыЗапрета);
	// В закрытом периоде уже ничего сделать не можем
	Если Действие.Имя = "ИзменениеЗакрытогоПериода" Тогда
		
		ЗаписьЖурналаРегистрации("Загрузка реализаций из Unicus",
			УровеньЖурналаРегистрации.Ошибка, , ДокументСсылка, "Не загружен документ: " + Данные.ID + ", дата изменения : " + Данные.ДатаИзменения + " меньше даты запрета: " + Действие.ДатаЗапрета);
		Возврат ДокументСсылка;	
		
	КонецЕсли;		
	
	Если Действие.Имя = "Редактирование" Тогда	
		
		// В открытом периоде сторно не делаем,
		// просто редактируем документ
		ДокументСсылка = ЗаполнитьДокументРТУ(ДокументСсылка, Данные, Параметры, СтруктураСсылок);
		
	ИначеЕсли Действие.Имя = "Корректировка" Тогда
		
		// Отвязали оплату
		Если Данные.СуммаОплаты = 0 Тогда
			ДокументСсылка = ЗаполнитьДокументСторно(ДокументСсылка, Данные, Параметры, СтруктураСсылок)
		Иначе	
			ДокументСсылка = ЗаполнитьДокументКорректировка(ДокументСсылка, Данные, Параметры, СтруктураСсылок);
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат ДокументСсылка;
	
КонецФункции

Функция ЗаполнитьДокументРТУ(ДокументСсылка, Данные, Параметры, СтруктураСсылок)
	
	ДанныеСуммы = АСЦ_UNICUS_Contracts.ПолучитьСуммы(Данные);
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		
		ДанныеДокумента = ПолучитьДанныеДокументаРТУ(ДокументСсылка);
	
		// Изменилось ЦФО,
		// тк ЦФО в договоре, то меняем сразу и помечаем к выгрузке
		Если ДанныеДокумента.ЦФО <> СтруктураСсылок.ЦФО Тогда
			ИзменитьЦФО(ДокументСсылка, СтруктураСсылок);	
		КонецЕсли;
		
		Если ИзменилисьСуммы(ДанныеДокумента, Данные, ДанныеСуммы, СтруктураСсылок)
			ИЛИ ИзменилисьРеквизиты(ДанныеДокумента, Данные, ДанныеСуммы, СтруктураСсылок)
			ИЛИ ИзменилисьПрочиеРеквизиты(ДанныеДокумента, Данные, ДанныеСуммы, СтруктураСсылок) Тогда
			
			// Редактирование документа
			ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
			
		// документ не изменился
		Иначе
		
			Если Параметры.ПерезаполнятьДокументы Тогда
				ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
			Иначе	
				Возврат ДокументСсылка;
			КонецЕсли;	
			
		КонецЕсли;	
		
	Иначе
		
		// Новый документ
		ДокументОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		
	КонецЕсли;	
	
	ВремяДокумента = Документы.РеализацияТоваровУслуг.ВремяДокументаПоУмолчанию();
	
	ДокументОбъект.Организация = СтруктураСсылок.Организация;
	ДокументОбъект.Дата        = Данные.Дата + 3600 * ВремяДокумента.Часы + 60 * ВремяДокумента.Минуты;
	ДокументОбъект.Контрагент  = СтруктураСсылок.Контрагент;
	ДокументОбъект.ДоговорКонтрагента = СтруктураСсылок.Договор;
	
	ДокументОбъект.ВалютаДокумента = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	ДокументОбъект.ВидОперации     = Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия;
	ДокументОбъект.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчиками; //76.05
	ДокументОбъект.СчетУчетаРасчетовПоАвансам     = ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчиками;
	ДокументОбъект.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически;
	
	ДокументОбъект.Услуги.Очистить();
	ДокументОбъект.АгентскиеУслуги.Очистить();
	
	Содержание = Данные.VIN + ", " + Данные.TRANSPORT_MARK + " " + Данные.TRANSPORT_MODEL;

	// Услуги
	Если ДанныеСуммы.СуммаВыручка <> 0 Тогда
		
		НоваяСтрока = ДокументОбъект.Услуги.Добавить();
		НоваяСтрока.Номенклатура = СтруктураСсылок.Номенклатура;
		НоваяСтрока.Содержание   = Содержание;		
		НоваяСтрока.Сумма        = ДанныеСуммы.СуммаВыручка;
		НоваяСтрока.СтавкаНДС    = Перечисления.СтавкиНДС.БезНДС;
		НоваяСтрока.СчетДоходов  = ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД;             //90.01.1
		НоваяСтрока.СчетРасходов = ПланыСчетов.Хозрасчетный.СебестоимостьПродажНеЕНВД; //90.02.1
		НоваяСтрока.СчетУчетаНДСПоРеализации = ПланыСчетов.Хозрасчетный.Продажи_НДС;   //90.03
		НоваяСтрока.Субконто     = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.Номенклатура, "НоменклатурнаяГруппа");
		
	КонецЕсли;
	
	
	// АгентскиеУслуги
	Если ДанныеСуммы.СуммаАгентсие <> 0 Тогда
		
		НоваяСтрока = ДокументОбъект.АгентскиеУслуги.Добавить();
		НоваяСтрока.Номенклатура = СтруктураСсылок.Номенклатура;
		НоваяСтрока.Содержание   = Содержание;
		НоваяСтрока.Сумма        = ДанныеСуммы.СуммаАгентсие;
		НоваяСтрока.СтавкаНДС    = Перечисления.СтавкиНДС.БезНДС;
		НоваяСтрока.Контрагент   = СтруктураСсылок.СК;
		НоваяСтрока.ДоговорКонтрагента = СтруктураСсылок.ДоговорСК;
		НоваяСтрока.СчетРасчетов = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.01.1");
	
	КонецЕсли;
	
	// При прямх расчетах деньги проходят мимо нас, 
	// поэтому проводок никаких не должно быть
	Если Данные.ТипПлатежа = "Прямые расчеты с СК" Тогда
		ДокументОбъект.РучнаяКорректировка = Истина;	
		ДокументОбъект.Комментарий = "Прямые расчеты с СК";
	КонецЕсли;	
	
	НачатьТранзакцию();
	Если ЗаписатьДокумент(ДокументОбъект, РежимЗаписиДокумента.Проведение, Параметры.ВыводитьСообщения) Тогда				
	
		Запись = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
		Запись.Объект   = ДокументОбъект.Ссылка;
		Запись.Свойство = Параметры.СвойствоID;
		Запись.Значение = Данные.ID;
		Запись.Записать();
		
		ДобавитьИзменениеОбъекта(ДокументОбъект.Ссылка, СтруктураСсылок.БазаАстра);
		
		ЗафиксироватьТранзакцию();
		
		СохранитьДатуПоследнегоДокумента(Данные.ДатаИзменения);
		
	Иначе	
		ОтменитьТранзакцию();
		
		// Если не смогли записать документ, 
		// тогда нужно сохранить ID для дальнейше обработки
		ЗаписьЖурналаРегистрации("Загрузка реализаций из Unicus",
			УровеньЖурналаРегистрации.Ошибка, , ДокументСсылка, "Не загружен документ корректировки: " + Данные.ID);
		
	КонецЕсли;
	
КонецФункции	

Функция ЗаполнитьДокументКорректировка(ДокументРТУ, Данные, Параметры, СтруктураСсылок)
	
	Если НЕ ЗначениеЗаполнено(ДокументРТУ) Тогда
		// Нет документа основания. редактируется документ, 
		//которого нет в базе. 
		// Не известны его первоначальные параметры, поэтому создавать ничего не будем
		Возврат Документы.КорректировкаРеализации.ПустаяСсылка();
	КонецЕсли;	
	
	ДанныеСуммы = АСЦ_UNICUS_Contracts.ПолучитьСуммы(Данные);
	
	ДокументСсылка = АСЦ_ПоискОбъектов.НайтиДокументКорректировки(ДокументРТУ);
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		
		ДанныеДокумента = ПолучитьДанныеДокументаКорректировка(ДокументСсылка);
	
		// Изменилось ЦФО,
		// тк ЦФО в договоре, то меняем сразу и помечаем к выгрузке
		Если ДанныеДокумента.ЦФО <> СтруктураСсылок.ЦФО Тогда
			ИзменитьЦФО(ДокументСсылка, СтруктураСсылок);
		КонецЕсли;
		
		// Изменился 1 из значимых показателей
		Если ИзменилисьСуммы(ДанныеДокумента, Данные, ДанныеСуммы, СтруктураСсылок) Тогда
			
			// Редактирование документа
			ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
			
		// Необходимо делать сторно и новую реализацию
		ИначеЕсли ИзменилисьРеквизиты(ДанныеДокумента, Данные, ДанныеСуммы, СтруктураСсылок) Тогда
			
		
		// документ не изменился
		Иначе
		
			Если Параметры.ПерезаполнятьДокументы Тогда
				ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
			Иначе	
				Возврат ДокументСсылка;
			КонецЕсли;	
			
		КонецЕсли;	
		
	Иначе
		
		// Новый документ
		ДокументОбъект = Документы.КорректировкаРеализации.СоздатьДокумент();
		ДокументОбъект.ДокументРеализации = ДокументРТУ;
		
	КонецЕсли;	
	
	ДокументОбъект.Услуги.Очистить();
	ДокументОбъект.АгентскиеУслуги.Очистить();
	
	ДокументОбъект.Заполнить(ДокументРТУ);
	
	ВремяДокумента = Документы.КорректировкаРеализации.ВремяДокументаПоУмолчанию();
	
	ДокументОбъект.Организация = СтруктураСсылок.Организация;
	ДокументОбъект.Дата        = Данные.ДатаИзменения + 3600 * ВремяДокумента.Часы + 60 * ВремяДокумента.Минуты;
	ДокументОбъект.Контрагент  = СтруктураСсылок.Контрагент;
	ДокументОбъект.ДоговорКонтрагента = СтруктураСсылок.Договор;
	
	Если ДокументОбъект.Услуги.Количество() > 0 Тогда
		
		СтрокаТЧ = ДокументОбъект.Услуги[0];
		СтрокаТЧ.Сумма = ДанныеСуммы.СуммаВыручка;
		
	КонецЕсли;	
	
	Если ДокументОбъект.АгентскиеУслуги.Количество() > 0 Тогда
		
		СтрокаТЧ = ДокументОбъект.АгентскиеУслуги[0];
		СтрокаТЧ.Сумма = ДанныеСуммы.СуммаАгентсие;
		
	КонецЕсли;	
	
	ДокументОбъект.Проведен = Истина;
	
	НачатьТранзакцию();
	Если ЗаписатьДокумент(ДокументОбъект, РежимЗаписиДокумента.Проведение, Параметры.ВыводитьСообщения) Тогда				
	
		ДобавитьИзменениеОбъекта(ДокументОбъект.Ссылка, СтруктураСсылок.БазаАстра);
		
		ЗафиксироватьТранзакцию();
		
		СохранитьДатуПоследнегоДокумента(Данные.ДатаИзменения);
		
	Иначе	
		ОтменитьТранзакцию();
		
		// Если не смогли записать документ, 
		// тогда нужно сохранить ID для дальнейше обработки
		ЗаписьЖурналаРегистрации("Загрузка реализаций из Unicus",
			УровеньЖурналаРегистрации.Ошибка, , ДокументРТУ, "Не загружен документ корректировки");
		
	КонецЕсли;
	
КонецФункции	

Функция ЗаполнитьДокументСторно(ДокументРТУ, Данные, Параметры, СтруктураСсылок)
	
	Если НЕ ЗначениеЗаполнено(ДокументРТУ) Тогда
		// Нет документа основания.
		// сторнировать нечего
		Возврат Документы.ОперацияБух.ПустаяСсылка();
	КонецЕсли;	
	
	ДокументСсылка = НайтиДокументСторно(ДокументРТУ);
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		// уже все отсторнировано;
		Возврат ДокументСсылка;
	КонецЕсли;	                                                                
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРТУ, "Организация, СуммаДокумента");
	
	ДокументОбъект = Документы.Операциябух.СоздатьДокумент();
	ДокументОбъект.Дата                 = Данные.ДатаИзменения;
	ДокументОбъект.Организация          = РеквизитыДокумента.Организация;
	ДокументОбъект.СуммаОперации        = -РеквизитыДокумента.СуммаДокумента;
	ДокументОбъект.СторнируемыйДокумент = ДокументРТУ;
	ДокументОбъект.СпособЗаполнения     = "Сторно";
	ДокументОбъект.Содержание = "Сторно документа """ + Строка(ДокументОбъект.СторнируемыйДокумент) + """";
	
	Для каждого Регистр из ДокументОбъект.СторнируемыйДокумент.Метаданные().Движения Цикл
		
		Если НЕ Метаданные.РегистрыНакопления.Содержит(Регистр) Тогда
			Продолжить;
		КонецЕсли;	
		
		НаборЗаписей = РегистрыНакопления[Регистр.Имя].СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ДокументОбъект.СторнируемыйДокумент);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0 Тогда
		
			НоваяСтрока = ДокументОбъект.ТаблицаРегистровНакопления.Добавить();
			НоваяСтрока.Имя = Регистр.Имя;
			
			НаборЗаписейНовый = ДокументОбъект.Движения[Регистр.Имя]; 
			НаборЗаписейНовый.Записывать = Истина;
			Для каждого Запись из НаборЗаписей Цикл
				
				ЗаписьНовая = НаборЗаписейНовый.Добавить();
				ЗаполнитьЗначенияСвойств(ЗаписьНовая, Запись);
				
				Для каждого Ресурс из Регистр.Ресурсы Цикл
					ЗаписьНовая[Ресурс.Имя] = -Запись[Ресурс.Имя];
				КонецЦикла;	
				
			КонецЦикла;	
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	НаборЗаписей = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДокументОбъект.СторнируемыйДокумент);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
	
		НаборЗаписейНовый = ДокументОбъект.Движения.Хозрасчетный;
		НаборЗаписейНовый.Записывать = Истина;
		НаборЗаписейНовый.Загрузить(НаборЗаписей.Выгрузить());
		
		Для каждого Запись из НаборЗаписейНовый Цикл
			
			Для каждого Ресурс из Метаданные.РегистрыБухгалтерии.Хозрасчетный.Ресурсы Цикл
				
				Если Ресурс.Балансовый Тогда
					Если ЗначениеЗаполнено(Запись[Ресурс.Имя]) Тогда
						Запись[Ресурс.Имя] = -Запись[Ресурс.Имя];
					КонецЕсли;	
				Иначе	
					
					Если ЗначениеЗаполнено(Запись[Ресурс.Имя + "Дт"]) Тогда
						Запись[Ресурс.Имя + "Дт"] = -Запись[Ресурс.Имя + "Дт"];
					КонецЕсли;	
					Если ЗначениеЗаполнено(Запись[Ресурс.Имя + "Кт"]) Тогда
						Запись[Ресурс.Имя + "Кт"] = -Запись[Ресурс.Имя + "Кт"];
					КонецЕсли;	
					
				КонецЕсли	
				
			КонецЦикла;
			
		КонецЦикла;	
		
	КонецЕсли;	
	
	НачатьТранзакцию();
	Если ЗаписатьДокумент(ДокументОбъект, РежимЗаписиДокумента.Запись, Параметры.ВыводитьСообщения) Тогда				
	
		ДобавитьИзменениеОбъекта(ДокументОбъект.Ссылка, СтруктураСсылок.БазаАстра);
		
		ЗафиксироватьТранзакцию();
		
		СохранитьДатуПоследнегоДокумента(Данные.ДатаИзменения);
		
	Иначе	
		ОтменитьТранзакцию();
		
		// Если не смогли записать документ, 
		// тогда нужно сохранить ID для дальнейше обработки
		ЗаписьЖурналаРегистрации("Загрузка реализаций из Unicus",
			УровеньЖурналаРегистрации.Ошибка, , ДокументРТУ, "Не загружен документ сторно");
		
	КонецЕсли;
	
КонецФункции	

#КонецОбласти

#Область Оплаты

Функция СоздатьДокументОплаты(Данные, Параметры, СтруктураСсылок, ДокРТУ)
	
	Если Данные.ТипПлатежа = "Наличные" Тогда
		СоздатьПКО(Данные, Параметры, СтруктураСсылок, ДокРТУ);
		
	ИначеЕсли Данные.ТипПлатежа = "Эквайринг" Тогда	
		СоздатьОплатуКартой(Данные, Параметры, СтруктураСсылок, ДокРТУ);
		
	КонецЕсли;	
	
	// Загружают из клиент банка
	//СоздатьПоступлениеНаРС(Данные, Параметры, СтруктураСсылок, ДокРТУ);
	
КонецФункции	

Функция СоздатьПКО(Данные, Параметры, СтруктураСсылок, ДокРТУ)
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Договор", СтруктураСсылок.Договор);
	Запрос.Параметры.Вставить("Дата1",   Данные.Дата);
	Запрос.Параметры.Вставить("Дата2",   КонецДня(Данные.Дата));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК Док
	|ГДЕ
	|	Док.ДоговорКонтрагента = &Договор
	|	И НЕ Док.Ссылка.ПометкаУдаления
	|	И Док.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		
		ДокументСсылка = Результат.Выгрузить()[0][0];
		
		Если Параметры.ПерезаполнятьДокументы = Истина Тогда
			ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
			ДокументОбъект.РасшифровкаПлатежа.Очистить();
		Иначе
			Возврат ДокументСсылка;
		КонецЕсли;
		
	Иначе
		ДокументОбъект = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
	КонецЕсли;
	
	ВремяДокумента = Документы.ПриходныйКассовыйОрдер.ВремяДокументаПоУмолчанию();
	ДокументОбъект.Дата        = Данные.Дата + 3600 * ВремяДокумента.Часы + 60 * ВремяДокумента.Минуты;
	
	ДокументОбъект.Заполнить(ДокРТУ);
	
	Для каждого СтрокаТЧ из ДокументОбъект.РасшифровкаПлатежа Цикл
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТЧ.ДоговорКонтрагента, "ОсновнаяСтатьяДвиженияДенежныхСредств, ОсновнойЦФО");
		СтрокаТЧ.СтатьяДвиженияДенежныхСредств = РеквизитыДоговора.ОсновнаяСтатьяДвиженияДенежныхСредств;
		СтрокаТЧ.ЦФО = РеквизитыДоговора.ОсновнойЦФО;
	КонецЦикла;	
	
	ДокументОбъект.Проведен = Истина;
	ЗаписатьДокумент(ДокументОбъект, Параметры.ВыводитьСообщения);				
	
	Возврат ДокументОбъект.Ссылка;
	
КонецФункции	

Функция СоздатьОплатуКартой(Данные, Параметры, СтруктураСсылок, ДокРТУ)
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Договор", СтруктураСсылок.Договор);
	Запрос.Параметры.Вставить("Дата1",   Данные.Дата);
	Запрос.Параметры.Вставить("Дата2",   КонецДня(Данные.Дата));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОплатаПлатежнойКартой.РасшифровкаПлатежа КАК Док
	|ГДЕ
	|	Док.ДоговорКонтрагента = &Договор
	|	И НЕ Док.Ссылка.ПометкаУдаления
	|	И Док.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		
		ДокументСсылка = Результат.Выгрузить()[0][0];
		
		Если Параметры.ПерезаполнятьДокументы = Истина Тогда
			ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
			ДокументОбъект.РасшифровкаПлатежа.Очистить();
		Иначе
			Возврат ДокументСсылка;
		КонецЕсли;
		
	Иначе
		ДокументОбъект = Документы.ОплатаПлатежнойКартой.СоздатьДокумент();
	КонецЕсли;
	
	ВремяДокумента = Документы.ОплатаПлатежнойКартой.ВремяДокументаПоУмолчанию();
	ДокументОбъект.Дата        = Данные.Дата + 3600 * ВремяДокумента.Часы + 60 * ВремяДокумента.Минуты;
	
	ДокументОбъект.Заполнить(ДокРТУ);
	
	ДокументОбъект.ВидОплаты = ПолучитьВидОплаты(Данные, Параметры, СтруктураСсылок);
	Если ЗначениеЗаполнено(ДокументОбъект.ВидОплаты) Тогда
	
		СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОбъект.ВидОплаты, "Контрагент, ДоговорКонтрагента, СчетУчетаРасчетов");
		ДокументОбъект.Эквайер = СтруктураРеквизитов.Контрагент;
		ДокументОбъект.ДоговорЭквайринга = СтруктураРеквизитов.ДоговорКонтрагента;
		
	КонецЕсли;	
	
	ДокументОбъект.Проведен = Истина;
	ЗаписатьДокумент(ДокументОбъект, Параметры.ВыводитьСообщения);				
	
	Возврат ДокументОбъект.Ссылка;
	
КонецФункции	

Функция СоздатьПоступлениеНаРС(Данные, Параметры, СтруктураСсылок, ДокРТУ)
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Договор", СтруктураСсылок.Договор);
	Запрос.Параметры.Вставить("Дата1",   Данные.Дата);
	Запрос.Параметры.Вставить("Дата2",   КонецДня(Данные.Дата));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет.РасшифровкаПлатежа КАК Док
	|ГДЕ
	|	Док.ДоговорКонтрагента = &Договор
	|	И НЕ Док.Ссылка.ПометкаУдаления
	|	И Док.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		
		ДокументСсылка = Результат.Выгрузить()[0][0];
		
		Если Параметры.ПерезаполнятьДокументы = Истина Тогда
			ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
			ДокументОбъект.РасшифровкаПлатежа.Очистить();
		Иначе
			Возврат ДокументСсылка;
		КонецЕсли;
		
	Иначе
		ДокументОбъект = Документы.ПоступлениеНаРасчетныйСчет.СоздатьДокумент();
	КонецЕсли;
	
	ВремяДокумента = Документы.ПоступлениеНаРасчетныйСчет.ВремяДокументаПоУмолчанию();
	ДокументОбъект.Дата        = Данные.Дата + 3600 * ВремяДокумента.Часы + 60 * ВремяДокумента.Минуты;
	
	ДокументОбъект.Заполнить(ДокРТУ);
	
	Для каждого СтрокаТЧ из ДокументОбъект.РасшифровкаПлатежа Цикл
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТЧ.ДоговорКонтрагента, "ОсновнаяСтатьяДвиженияДенежныхСредств, ОсновнойЦФО");
		СтрокаТЧ.СтатьяДвиженияДенежныхСредств = РеквизитыДоговора.ОсновнаяСтатьяДвиженияДенежныхСредств;
		СтрокаТЧ.ЦФО = РеквизитыДоговора.ОсновнойЦФО;
	КонецЦикла;	
	
	ДокументОбъект.Проведен = Истина;
	ЗаписатьДокумент(ДокументОбъект, Параметры.ВыводитьСообщения);				
	
	Возврат ДокументОбъект.Ссылка;
	
КонецФункции	

#КонецОбласти

