
&НаКлиенте
Процедура ЗагрузитьЗакрытыеПериоды(Команда)
	ЗагрузитьЗакрытыеПериодыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьЗакрытыеПериодыНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("База",              База);
	СтруктураПараметров.Вставить("ВыводитьСообщения", ВыводитьСообщения);
	
	АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, ЭтаФорма.УникальныйИдентификатор);
	ОбработкаОбъект.ЗагрузитьЗакрытыеПериоды(СтруктураПараметров, АдресРезультата);
	
КонецПроцедуры
