
&НаКлиенте
Процедура Прочитать(Команда)
	ПрочитатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Родитель", Справочники.Номенклатура.НайтиПоНаименованию("Страховки"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Родитель = &Родитель";
	
	ТаблицаДанных.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Кэш = Новый Соответствие;
	Для каждого СтрокаТЗ из ТаблицаДанных Цикл
		СтрокаТЗ.Статья = АСЦ_ПоискОбъектов.ПолучитьОбъектПоСоотвествию(СтрокаТЗ.Наименование, Объект.Настройка, Объект.База, Кэш);
	КонецЦикла;	
	
	Элементы.ТаблицаДанныхЗаписать.КнопкаПоУмолчанию = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;	
	
	ЗаписатьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "НаименованиеUNICUS");
	
	Для каждого СтрокаТЗ из ТаблицаДанных Цикл
		
		Если НЕ СтрокаТЗ.Изменен Тогда
			Продолжить;
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЗ.Статья) Тогда
			Продолжить;
		КонецЕсли;	
		
		НаборЗаписей = РегистрыСведений.СоответствиеОбъектовТекущейИВнешнихИБ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИспользуемаяИБ.Установить(Объект.База, Истина);
		НаборЗаписей.Отбор.ОбъектВнешнейИБ.Установить(СтрокаТЗ.Наименование, Истина);
		НаборЗаписей.Отбор.НастройкаСоответствия.Установить(Объект.Настройка, Истина);
		
		Запись = НаборЗаписей.Добавить();
		Запись.ОбъектТекущейИБ = СтрокаТЗ.Статья;
		Запись.ИспользуемаяИБ  = Объект.База;
		Запись.ОбъектВнешнейИБ = СтрокаТЗ.Наименование;
		Запись.НастройкаСоответствия = Объект.Настройка;
		
		НаборЗаписей.Записать();
		
		СтрокаТЗ.Изменен = Ложь;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДанныхОрганизацияПриИзменении(Элемент)
	
	Элементы.ТаблицаДанных.ТекущиеДанные.Изменен = Истина;
	
КонецПроцедуры

&НаСервере
Процедура БазаПриИзмененииНаСервере()
	
	Объект.ТипБазы = Объект.База.ТипБД;
	
КонецПроцедуры

&НаКлиенте
Процедура БазаПриИзменении(Элемент)
	БазаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.База = Справочники.ВнешниеИнформационныеБазы.НайтиПоНаименованию("Юникус");
	Объект.Настройка = Справочники.СоответствиеВнешнимИБ.НайтиПоНаименованию("Номенклатура <-> Статьи доходов",,, Объект.База.ТипБД);
	
	Если НЕ ПравоДоступа("Изменение", Метаданные.РегистрыСведений.СоответствиеОбъектовТекущейИВнешнихИБ) Тогда
		ТолькоПросмотр = Истина;
	Конецесли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЗаполнить(Команда)
	ПроверкаЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверкаЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("База",      Объект.База);
	Запрос.Параметры.Вставить("Настройка", Объект.Настройка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Номенклатура КАК Номенклатура,
	|	Док.Ссылка.ДоговорКонтрагента КАК Договор,
	|	Док.Ссылка.ДоговорКонтрагента.ОсновнаяСтатьяИсполнение КАК Статья,
	|	Рег.ОбъектТекущейИБ КАК СтатьяНовая
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Услуги КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеОбъектовТекущейИВнешнихИБ КАК Рег
	|		ПО (Рег.ИспользуемаяИБ = &База)
	|			И (Рег.НастройкаСоответствия = &Настройка)
	|			И Док.Номенклатура.Наименование = Рег.ОбъектВнешнейИБ
	|ГДЕ
	|	НЕ Док.Ссылка.ПометкаУдаления
	|	И Док.Ссылка.ДоговорКонтрагента.ОсновнаяСтатьяИсполнение <> Рег.ОбъектТекущейИБ";
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	ТаблицаПроверки.Загрузить(ТЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаИзменитьСтатью(Команда)
	
	ПроверкаИзменитьСтатьюНаСервере();
	Состояние("Статья изменена");
	
КонецПроцедуры

&НаСервере
Процедура ПроверкаИзменитьСтатьюНаСервере()
	
	Для каждого СтрокаТЗ из ТаблицаПроверки Цикл
		
		СпрОбъект = СтрокаТЗ.Договор.ПолучитьОбъект();
		СпрОбъект.ОсновнаяСтатьяИсполнение = СтрокаТЗ.СтатьяНовая;
		СпрОБъект.Записать();
		
	КонецЦикла;	
	
КонецПроцедуры
